[
  {
    "name": "Monkey D. Luffy",
    "anime": "One Piece",
    "gender": "male",
    "description": "Captain of the Straw Hat Pirates, with the ability of the Gomu Gomu no Mi that allows him to stretch like rubber.",
    "age": 19
  },
  {
    "name": "Roronoa Zoro",
    "anime": "One Piece",
    "gender": "male",
    "description": "Swordsman of the Straw Hat Pirates, known for his three-sword style and his dream of becoming the world's greatest swordsman.",
    "age": 21
  },
  {
    "name": "Nami",
    "anime": "One Piece",
    "gender": "female",
    "description": "Navigator of the Straw Hat Pirates, an expert in cartography and meteorology, dreams of drawing a complete map of the world.",
    "age": 20
  },
  {
    "name": "Usopp",
    "anime": "One Piece",
    "gender": "male",
    "description": "Sniper and accomplished liar of the Straw Hat Pirates, with exceptional skills in gadgetry and great marksmanship.",
    "age": 19
  },
  {
    "name": "Sanji",
    "anime": "One Piece",
    "gender": "male",
    "description": "Cook of the Straw Hat Pirates, famous for his cooking skills and his combat style using kicks.",
    "age": 21
  },
  {
    "name": "Tony Tony Chopper",
    "anime": "One Piece",
    "gender": "male",
    "description": "Doctor of the Straw Hat Pirates, a reindeer who ate the Hito Hito no Mi and can transform into various forms.",
    "age": 17
  },
  {
    "name": "Nico Robin",
    "anime": "One Piece",
    "gender": "female",
    "description": "Archaeologist of the Straw Hat Pirates, with the power of the Hana Hana no Mi that allows her to create body parts on any surface.",
    "age": 30
  },
  {
    "name": "Franky",
    "anime": "One Piece",
    "gender": "male",
    "description": "Shipwright of the Straw Hat Pirates, a cyborg with advanced mechanical skills and immense strength.",
    "age": 36
  },
  {
    "name": "Brook",
    "anime": "One Piece",
    "gender": "male",
    "description": "Musician of the Straw Hat Pirates, a living skeleton who ate the Yomi Yomi no Mi, allowing him to revive after death.",
    "age": 90
  },
  {
    "name": "Jinbe",
    "anime": "One Piece",
    "gender": "male",
    "description": "Steersman of the Straw Hat Pirates, a fish-man with advanced Haki abilities and aquatic martial arts techniques.",
    "age": 46
  },
  {
    "name": "Gol D. Roger",
    "anime": "One Piece",
    "gender": "male",
    "description": "The Pirate King whose execution sparked the Great Pirate Era, known for having found the One Piece.",
    "age": 53
  },
  {
    "name": "Edward Newgate",
    "anime": "One Piece",
    "gender": "male",
    "description": "Known as Whitebeard, one of the Four Emperors of the Sea, possessing the ability to cause earthquakes with the Gura Gura no Mi.",
    "age": 72
  },
  {
    "name": "Shanks",
    "anime": "One Piece",
    "gender": "male",
    "description": "One of the Four Emperors of the Sea and Luffy's former crew mate, known for his relaxed attitude and swordsmanship.",
    "age": 39
  },
  {
    "name": "Big Mom",
    "anime": "One Piece",
    "gender": "female",
    "description": "One of the Four Emperors of the Sea, known for her enormous size and ability to control souls with the Soru Soru no Mi.",
    "age": 68
  },
  {
    "name": "Kaido",
    "anime": "One Piece",
    "gender": "male",
    "description": "One of the Four Emperors of the Sea, with the power to transform into a dragon and an almost invincible durability.",
    "age": 59
  },
  {
    "name": "Trafalgar D. Water Law",
    "anime": "One Piece",
    "gender": "male",
    "description": "Captain of the Heart Pirates, with the power of the Ope Ope no Mi, allowing him to manipulate space within a specific area.",
    "age": 26
  },
  {
    "name": "Eustass Kid",
    "anime": "One Piece",
    "gender": "male",
    "description": "Captain of the Kid Pirates, known for his ability to manipulate metals and his ambition to become the Pirate King.",
    "age": 23
  },
  {
    "name": "Donquixote Doflamingo",
    "anime": "One Piece",
    "gender": "male",
    "description": "Former Shichibukai and leader of the Donquixote family, with the power to manipulate objects and people with the Ito Ito no Mi.",
    "age": 41
  },
  {
    "name": "Crocodile",
    "anime": "One Piece",
    "gender": "male",
    "description": "Ex-Shichibukai and leader of Baroque Works, with the power of the Suna Suna no Mi that allows him to control sand and dehydration.",
    "age": 41
  },
  {
    "name": "Nefertari Vivi",
    "anime": "One Piece",
    "gender": "female",
    "description": "Princess of Alabasta and ally of the Straw Hat Pirates, fighting to protect her kingdom from Crocodile's threat.",
    "age": 19
  },
  {
    "name": "Portgas D. Ace",
    "anime": "One Piece",
    "gender": "male",
    "description": "Luffy's adoptive brother and commander of the Whitebeard Pirates' First Division, with the ability to control fire.",
    "age": 20
  },
  {
    "name": "Sabo",
    "anime": "One Piece",
    "gender": "male",
    "description": "Luffy's adoptive brother and leader of the Revolutionaries, with the ability to control fire thanks to the Mera Mera no Mi.",
    "age": 22
  },
  {
    "name": "Bartolomeo",
    "anime": "One Piece",
    "gender": "male",
    "description": "Captain of the Barto Pirates, with the power of the Bari Bari no Mi that allows him to create impenetrable barriers.",
    "age": 19
  },
  {
    "name": "X Drake",
    "anime": "One Piece",
    "gender": "male",
    "description": "One of the New Emperors of the Sea and former Marine, with the ability to transform into a dinosaur.",
    "age": 33
  },
  {
    "name": "Jewelry Bonney",
    "anime": "One Piece",
    "gender": "female",
    "description": "One of the Supernovas, with the ability of the Boni Boni no Mi that allows her to alter the age of people.",
    "age": 24
  },
  {
    "name": "Killer",
    "anime": "One Piece",
    "gender": "male",
    "description": "Member of the Kid Pirates and close friend of Eustass Kid, known for his skills with blades and enigmatic character.",
    "age": 24
  },
  {
    "name": "Aokiji",
    "anime": "One Piece",
    "gender": "male",
    "description": "Former Marine Admiral with the power to control ice thanks to the Hie Hie no Mi, now a member of the Revolutionaries.",
    "age": 49
  },
  {
    "name": "Kizaru",
    "anime": "One Piece",
    "gender": "male",
    "description": "Marine Admiral with the power of the Pika Pika no Mi, allowing him to move at the speed of light and shoot lasers.",
    "age": 50
  },
  {
    "name": "Akainu",
    "anime": "One Piece",
    "gender": "male",
    "description": "Marine Admiral known for his ruthless absolute justice, with the power to control magma using the Magu Magu no Mi.",
    "age": 60
  },
  {
    "name": "Sengoku",
    "anime": "One Piece",
    "gender": "male",
    "description": "Former Marine Admiral and former Fleet Admiral, with the power to transform into a giant golden Buddha thanks to the Hito Hito no Mi.",
    "age": 76
  },
  {
    "name": "Monkey D. Garp",
    "anime": "One Piece",
    "gender": "male",
    "description": "Vice Admiral of the Marine and Luffy's grandfather, known for his incredible physical strength and relaxed attitude.",
    "age": 76
  },
  {
    "name": "Smoker",
    "anime": "One Piece",
    "gender": "male",
    "description": "Marine Commander with the power of the Moku Moku no Mi, allowing him to control smoke and create fog.",
    "age": 32
  },
  {
    "name": "Tashigi",
    "anime": "One Piece",
    "gender": "female",
    "description": "Marine Lieutenant and skilled swordswoman who seeks to recover valuable swords that have been stolen.",
    "age": 26
  },
  {
    "name": "Kong",
    "anime": "One Piece",
    "gender": "male",
    "description": "Former Fleet Admiral of the Marine, a figure of great authority in the world of the Marines.",
    "age": 84
  },
  {
    "name": "Dr. Vegapunk",
    "anime": "One Piece",
    "gender": "male",
    "description": "Genius scientist known for his advanced research and development of the Pacifista technology.",
    "age": 62
  },
  {
    "name": "Monet",
    "anime": "One Piece",
    "gender": "female",
    "description": "Member of the Donquixote Pirates with the power of the Yuki Yuki no Mi, allowing her to control snow.",
    "age": 22
  },
  {
    "name": "Caesar Clown",
    "anime": "One Piece",
    "gender": "male",
    "description": "Mad scientist and former member of Baroque Works, with the ability to control poisonous gases.",
    "age": 40
  },
  {
    "name": "Donquixote Rosinante",
    "anime": "One Piece",
    "gender": "male",
    "description": "Younger brother of Doflamingo and former Shichibukai, known for his noble sacrifice and skill with Rokushiki.",
    "age": 31
  },
  {
    "name": "Kurohige",
    "anime": "One Piece",
    "gender": "male",
    "description": "Also known as Blackbeard, captain of the Blackbeard Pirates and user of two Devil Fruits.",
    "age": 42
  },
  {
    "name": "Charlotte Katakuri",
    "anime": "One Piece",
    "gender": "male",
    "description": "Commander of Big Mom's fleet, known for his Haki abilities and power to turn his body into mochi.",
    "age": 48
  },
  {
    "name": "Pudding",
    "anime": "One Piece",
    "gender": "female",
    "description": "Daughter of Big Mom and Charlotte Katakuri's sister, known for her mind-reading ability and dual personality.",
    "age": 30
  },
  {
    "name": "Vinsmoke Judge",
    "anime": "One Piece",
    "gender": "male",
    "description": "Leader of the Vinsmoke family and Sanji's father, known for his science skills and the creation of enhanced clones.",
    "age": 53
  },
  {
    "name": "Sanji's Brothers",
    "anime": "One Piece",
    "gender": "male",
    "description": "Sanji's siblings, members of the Germa 66 army, each with enhancements from their father's technology.",
    "age": 22
  },
  {
    "name": "Niji",
    "anime": "One Piece",
    "gender": "male",
    "description": "One of Sanji's brothers, known for his ability to manipulate electricity thanks to Germa 66 technology.",
    "age": 22
  },
  {
    "name": "Ichiji",
    "anime": "One Piece",
    "gender": "male",
    "description": "Another of Sanji's brothers, with fire abilities due to Germa 66's genetic modifications.",
    "age": 22
  },
  {
    "name": "Reiju",
    "anime": "One Piece",
    "gender": "female",
    "description": "Sanji's sister and member of the Vinsmoke family, with poison abilities and great combat skills.",
    "age": 24
  },
  {
    "name": "Galdino",
    "anime": "One Piece",
    "gender": "male",
    "description": "Also known as Mr. 3, former Baroque Works member with the power of the Doru Doru no Mi to create wax.",
    "age": 45
  },
  {
    "name": "Wapol",
    "anime": "One Piece",
    "gender": "male",
    "description": "Former King of Drum Island, known for his ability to eat and absorb materials thanks to the Baku Baku no Mi.",
    "age": 30
  },
  {
    "name": "Morgans",
    "anime": "One Piece",
    "gender": "male",
    "description": "Owner of the 'World Economic Journal', known for his influence and ability to inform the world.",
    "age": 60
  },
  {
    "name": "Foxy",
    "anime": "One Piece",
    "gender": "male",
    "description": "Captain of the Foxy Pirates, known for his gambling skills and the power of the Noro Noro no Mi that slows down time.",
    "age": 30
  },
  {
    "name": "Naruto Uzumaki",
    "anime": "Naruto",
    "gender": "male",
    "description": "The main protagonist of the series, a ninja with the dream of becoming Hokage and possessing the Nine-Tails Fox within him.",
    "age": 17
  },
  {
    "name": "Sasuke Uchiha",
    "anime": "Naruto",
    "gender": "male",
    "description": "Naruto's rival and best friend, a member of the Uchiha clan with a quest for vengeance and the power of the Sharingan.",
    "age": 17
  },
  {
    "name": "Sakura Haruno",
    "anime": "Naruto",
    "gender": "female",
    "description": "A member of Team 7, known for her strong physical strength and healing abilities as a skilled medical ninja.",
    "age": 17
  },
  {
    "name": "Kakashi Hatake",
    "anime": "Naruto",
    "gender": "male",
    "description": "The leader of Team 7, a skilled ninja with the Sharingan and a reputation for his copy ninja abilities.",
    "age": 29
  },
  {
    "name": "Hinata Hyuga",
    "anime": "Naruto",
    "gender": "female",
    "description": "A member of the Hyuga clan with the Byakugan, known for her gentle personality and exceptional Taijutsu skills.",
    "age": 16
  },
  {
    "name": "Shikamaru Nara",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of Team 10, known for his high intelligence and the ability to manipulate shadows.",
    "age": 17
  },
  {
    "name": "Ino Yamanaka",
    "anime": "Naruto",
    "gender": "female",
    "description": "A member of Team 10, skilled in mind transfer techniques and a talented medical ninja.",
    "age": 17
  },
  {
    "name": "Choji Akimichi",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of Team 10, known for his ability to expand his body and use the expansion jutsu.",
    "age": 17
  },
  {
    "name": "Neji Hyuga",
    "anime": "Naruto",
    "gender": "male",
    "description": "A prodigy of the Hyuga clan with the Byakugan, known for his exceptional skills in the Gentle Fist style.",
    "age": 17
  },
  {
    "name": "Tenten",
    "anime": "Naruto",
    "gender": "female",
    "description": "A member of Team Guy, known for her proficiency with weapons and her weapon-based jutsu.",
    "age": 16
  },
  {
    "name": "Rock Lee",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of Team Guy, known for his incredible strength and skill in Taijutsu, despite lacking chakra-based abilities.",
    "age": 16
  },
  {
    "name": "Might Guy",
    "anime": "Naruto",
    "gender": "male",
    "description": "Leader of Team Guy, renowned for his extraordinary Taijutsu skills and the use of the Eight Gates technique.",
    "age": 31
  },
  {
    "name": "Temari",
    "anime": "Naruto",
    "gender": "female",
    "description": "A kunoichi from the Sand Village, known for her Wind Release techniques and the use of a giant fan in combat.",
    "age": 17
  },
  {
    "name": "Kankuro",
    "anime": "Naruto",
    "gender": "male",
    "description": "Temari's brother, a puppet master from the Sand Village who uses various puppets in battle.",
    "age": 17
  },
  {
    "name": "Gaara",
    "anime": "Naruto",
    "gender": "male",
    "description": "The current Kazekage of the Sand Village, known for his ability to manipulate sand and the Shukaku demon within him.",
    "age": 17
  },
  {
    "name": "Jiraiya",
    "anime": "Naruto",
    "gender": "male",
    "description": "One of the Legendary Sannin, a mentor to Naruto with exceptional skills in ninjutsu and a perverted personality.",
    "age": 50
  },
  {
    "name": "Orochimaru",
    "anime": "Naruto",
    "gender": "male",
    "description": "One of the Legendary Sannin, known for his pursuit of immortality and mastery of forbidden jutsu.",
    "age": 50
  },
  {
    "name": "Tsunade",
    "anime": "Naruto",
    "gender": "female",
    "description": "One of the Legendary Sannin and the Fifth Hokage, known for her immense strength and medical expertise.",
    "age": 50
  },
  {
    "name": "Minato Namikaze",
    "anime": "Naruto",
    "gender": "male",
    "description": "The Fourth Hokage, Naruto's father, known for his speed and the ability to use the Flying Thunder God technique.",
    "age": 24
  },
  {
    "name": "Kushina Uzumaki",
    "anime": "Naruto",
    "gender": "female",
    "description": "Naruto's mother, known for her strength and the power of the Nine-Tails Fox sealed within her.",
    "age": 24
  },
  {
    "name": "Danzo Shimura",
    "anime": "Naruto",
    "gender": "male",
    "description": "A high-ranking member of Konoha's elders, known for his secretive and manipulative nature.",
    "age": 72
  },
  {
    "name": "Hiruzen Sarutobi",
    "anime": "Naruto",
    "gender": "male",
    "description": "The Third Hokage, known for his vast knowledge and experience in all forms of ninjutsu.",
    "age": 68
  },
  {
    "name": "Kabuto Yakushi",
    "anime": "Naruto",
    "gender": "male",
    "description": "A former ally of Orochimaru who becomes a major antagonist with skills in medical ninjutsu and espionage.",
    "age": 21
  },
  {
    "name": "Sasori",
    "anime": "Naruto",
    "gender": "male",
    "description": "A former member of the Akatsuki, known for his skills in puppet mastery and his use of human puppets.",
    "age": 28
  },
  {
    "name": "Deidara",
    "anime": "Naruto",
    "gender": "male",
    "description": "A former member of the Akatsuki, known for his explosive clay-based jutsu and artistic philosophy.",
    "age": 21
  },
  {
    "name": "Kisame Hoshigaki",
    "anime": "Naruto",
    "gender": "male",
    "description": "A former member of the Akatsuki, known for his shark-like appearance and mastery of water-based jutsu.",
    "age": 32
  },
  {
    "name": "Hidan",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the Akatsuki with immortality, known for his religious rituals and his cursed technique.",
    "age": 22
  },
  {
    "name": "Kakuzu",
    "anime": "Naruto",
    "gender": "male",
    "description": "A former member of the Akatsuki, known for his ability to control threads and his use of multiple hearts.",
    "age": 91
  },
  {
    "name": "Zetsu",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the Akatsuki with a split personality, one being a plant-based ninja and the other a carnivorous ninja.",
    "age": 27
  },
  {
    "name": "Orochimaru's Snake",
    "anime": "Naruto",
    "gender": "female",
    "description": "A large snake that serves as a summon for Orochimaru, used for transportation and combat.",
    "age": 24
  },
  {
    "name": "Anko Mitarashi",
    "anime": "Naruto",
    "gender": "female",
    "description": "A former student of Orochimaru, known for her expertise in cursed seals and her dark past.",
    "age": 26
  },
  {
    "name": "Yugao Uzuki",
    "anime": "Naruto",
    "gender": "female",
    "description": "A member of the ANBU Black Ops, known for her skills in stealth and combat.",
    "age": 25
  },
  {
    "name": "Ibiki Morino",
    "anime": "Naruto",
    "gender": "male",
    "description": "An ANBU Black Ops member and head of the Torture and Interrogation Division, known for his intimidating presence.",
    "age": 32
  },
  {
    "name": "Genma Shiranui",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the ANBU Black Ops known for his expertise in combat and his signature toothpick.",
    "age": 30
  },
  {
    "name": "Raikage A",
    "anime": "Naruto",
    "gender": "male",
    "description": "The Fourth Raikage of the Cloud Village, known for his immense strength and speed.",
    "age": 42
  },
  {
    "name": "Tobi",
    "anime": "Naruto",
    "gender": "male",
    "description": "A former member of the Akatsuki who is later revealed to be Uchiha Obito, known for his power and manipulative nature.",
    "age": 30
  },
  {
    "name": "Obito Uchiha",
    "anime": "Naruto",
    "gender": "male",
    "description": "A former member of the Uchiha clan who becomes the primary antagonist, known for his use of the Sharingan and later the Rinnegan.",
    "age": 31
  },
  {
    "name": "Madara Uchiha",
    "anime": "Naruto",
    "gender": "male",
    "description": "A legendary member of the Uchiha clan, known for his powerful abilities and role in the founding of Konoha.",
    "age": 70
  },
  {
    "name": "Hashirama Senju",
    "anime": "Naruto",
    "gender": "male",
    "description": "The First Hokage, known for his immense power and ability to control wood-based jutsu.",
    "age": 70
  },
  {
    "name": "Tobirama Senju",
    "anime": "Naruto",
    "gender": "male",
    "description": "The Second Hokage, known for his mastery of water-based jutsu and creation of the ANBU.",
    "age": 50
  },
  {
    "name": "Haku",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the 'Demon Brothers' with ice-based jutsu and a tragic past, loyal to Zabuza Momochi.",
    "age": 15
  },
  {
    "name": "Zabuza Momochi",
    "anime": "Naruto",
    "gender": "male",
    "description": "A former member of the Seven Ninja Swordsmen of the Mist, known for his skill with the sword and his pursuit of strength.",
    "age": 26
  },
  {
    "name": "Jugo",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the Orochimaru's experiment subjects, known for his ability to transform into a monster-like state.",
    "age": 29
  },
  {
    "name": "Karin",
    "anime": "Naruto",
    "gender": "female",
    "description": "A former member of Orochimaru's group with the ability to sense chakra and heal wounds.",
    "age": 27
  },
  {
    "name": "Suigetsu Hozuki",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the Seven Ninja Swordsmen of the Mist, known for his ability to transform his body into water.",
    "age": 17
  },
  {
    "name": "Killer Bee",
    "anime": "Naruto",
    "gender": "male",
    "description": "The Jinchuriki of the Eight-Tails, known for his rap skills and mastery of sword techniques.",
    "age": 33
  },
  {
    "name": "Mabui",
    "anime": "Naruto",
    "gender": "female",
    "description": "A secretary of the Raikage, known for her abilities in space-time ninjutsu.",
    "age": 30
  },
  {
    "name": "Aoba Yamashiro",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the Konoha Intelligence Division, known for his skills in reconnaissance and information gathering.",
    "age": 27
  },
  {
    "name": "Shizune",
    "anime": "Naruto",
    "gender": "female",
    "description": "Tsunade's apprentice and a skilled medical ninja, known for her expertise and loyalty to her mentor.",
    "age": 32
  },
  {
    "name": "Tayuya",
    "anime": "Naruto",
    "gender": "female",
    "description": "A member of the Sound Four with the ability to control demons through her flute.",
    "age": 16
  },
  {
    "name": "Sakon",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the Sound Four with the ability to merge his body with others.",
    "age": 18
  },
  {
    "name": "Kankuro",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the Sand Village, known for his skills in puppet mastery and his various combat puppets.",
    "age": 17
  },
  {
    "name": "Jūgo",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of Orochimaru's experiment subjects, known for his ability to transform into a monster-like state.",
    "age": 29
  },
  {
    "name": "Karin",
    "anime": "Naruto",
    "gender": "female",
    "description": "A former member of Orochimaru's group with the ability to sense chakra and heal wounds.",
    "age": 27
  },
  {
    "name": "Suigetsu Hozuki",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the Seven Ninja Swordsmen of the Mist, known for his ability to transform his body into water.",
    "age": 17
  },
  {
    "name": "Killer Bee",
    "anime": "Naruto",
    "gender": "male",
    "description": "The Jinchuriki of the Eight-Tails, known for his rap skills and mastery of sword techniques.",
    "age": 33
  },
  {
    "name": "Mabui",
    "anime": "Naruto",
    "gender": "female",
    "description": "A secretary of the Raikage, known for her abilities in space-time ninjutsu.",
    "age": 30
  },
  {
    "name": "Aoba Yamashiro",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the Konoha Intelligence Division, known for his skills in reconnaissance and information gathering.",
    "age": 27
  },
  {
    "name": "Shizune",
    "anime": "Naruto",
    "gender": "female",
    "description": "Tsunade's apprentice and a skilled medical ninja, known for her expertise and loyalty to her mentor.",
    "age": 32
  },
  {
    "name": "Tayuya",
    "anime": "Naruto",
    "gender": "female",
    "description": "A member of the Sound Four with the ability to control demons through her flute.",
    "age": 16
  },
  {
    "name": "Sakon",
    "anime": "Naruto",
    "gender": "male",
    "description": "A member of the Sound Four with the ability to merge his body with others.",
    "age": 18
  },
  {
    "name": "Ichigo Kurosaki",
    "anime": "Bleach",
    "gender": "male",
    "description": "The main protagonist, a teenager with the ability to see ghosts and a Soul Reaper with the duty to protect the living world.",
    "age": 15
  },
  {
    "name": "Rukia Kuchiki",
    "anime": "Bleach",
    "gender": "female",
    "description": "A Soul Reaper who initially transfers her powers to Ichigo and becomes his mentor in the world of Soul Reapers.",
    "age": 150
  },
  {
    "name": "Renji Abarai",
    "anime": "Bleach",
    "gender": "male",
    "description": "A Soul Reaper and lieutenant of the 6th Division, known for his strong bond with Rukia and his powerful zanpakuto, Zabimaru.",
    "age": 30
  },
  {
    "name": "Byakuya Kuchiki",
    "anime": "Bleach",
    "gender": "male",
    "description": "The 6th Division captain and Rukia's older brother, known for his calm demeanor and powerful zanpakuto, Senbonzakura.",
    "age": 200
  },
  {
    "name": "Orihime Inoue",
    "anime": "Bleach",
    "gender": "female",
    "description": "A human with the ability to heal and reject events, her powers are linked to the Shun Shun Rikka spirits.",
    "age": 15
  },
  {
    "name": "Uryu Ishida",
    "anime": "Bleach",
    "gender": "male",
    "description": "A Quincy, a human with the ability to manipulate spiritual energy and fight against hollows using arrows.",
    "age": 15
  },
  {
    "name": "Yasutora Sado",
    "anime": "Bleach",
    "gender": "male",
    "description": "Also known as Chad, Ichigo's friend with the ability to manifest powerful spiritual energy in his arms.",
    "age": 15
  },
  {
    "name": "Kisuke Urahara",
    "anime": "Bleach",
    "gender": "male",
    "description": "The former captain of the 12th Division, now a shop owner with extensive knowledge of Soul Reaper and Quincy techniques.",
    "age": 200
  },
  {
    "name": "Yoruichi Shihouin",
    "anime": "Bleach",
    "gender": "female",
    "description": "The former captain of the 2nd Division and the best friend of Kisuke Urahara, known for her agility and transformation abilities.",
    "age": 200
  },
  {
    "name": "Toshiro Hitsugaya",
    "anime": "Bleach",
    "gender": "male",
    "description": "The youngest captain of the 10th Division, known for his ice-based zanpakuto, Hyorinmaru.",
    "age": 10
  },
  {
    "name": "Sosuke Aizen",
    "anime": "Bleach",
    "gender": "male",
    "description": "The former captain of the 5th Division who becomes the main antagonist, known for his mastery of illusion and manipulation.",
    "age": 200
  },
  {
    "name": "Gin Ichimaru",
    "anime": "Bleach",
    "gender": "male",
    "description": "A former captain of the 3rd Division and Aizen's right-hand man, known for his deceptive nature and zanpakuto, Shinsou.",
    "age": 100
  },
  {
    "name": "Kaname Tosen",
    "anime": "Bleach",
    "gender": "male",
    "description": "A former captain of the 9th Division, known for his blindness and ability to manipulate sound with his zanpakuto, Suzumushi.",
    "age": 100
  },
  {
    "name": "Ulquiorra Cifer",
    "anime": "Bleach",
    "gender": "male",
    "description": "The 4th Espada in the Arrancar army, known for his cold demeanor and the power of his zanpakuto, Murcielago.",
    "age": 100
  },
  {
    "name": "Grimmjow Jaegerjaquez",
    "anime": "Bleach",
    "gender": "male",
    "description": "The 6th Espada in the Arrancar army, known for his ferocity and his zanpakuto, Pantera.",
    "age": 100
  },
  {
    "name": "Nnoitra Gilga",
    "anime": "Bleach",
    "gender": "male",
    "description": "The 5th Espada, known for his arrogance and combat skills, wielding the zanpakuto, Santa Teresa.",
    "age": 100
  },
  {
    "name": "Neliel Tu Odelschwanck",
    "anime": "Bleach",
    "gender": "female",
    "description": "The former 3rd Espada who becomes an ally of Ichigo, known for her childlike appearance and powerful zanpakuto, Gamuza.",
    "age": 100
  },
  {
    "name": "Barragan Luisenbarn",
    "anime": "Bleach",
    "gender": "male",
    "description": "The 1st Espada, known for his power over aging and decay, wielding the zanpakuto, Arrogante.",
    "age": 100
  },
  {
    "name": "Coyote Starrk",
    "anime": "Bleach",
    "gender": "male",
    "description": "The 1st Espada, known for his powerful spiritual energy and zanpakuto, Los Lobos.",
    "age": 100
  },
  {
    "name": "Harribel",
    "anime": "Bleach",
    "gender": "female",
    "description": "The 3rd Espada, known for her water-based zanpakuto, Tiburon, and her calm demeanor.",
    "age": 100
  },
  {
    "name": "Zaraki Kenpachi",
    "anime": "Bleach",
    "gender": "male",
    "description": "The captain of the 11th Division, known for his love of combat and immense physical strength.",
    "age": 30
  },
  {
    "name": "Yachiru Kusajishi",
    "anime": "Bleach",
    "gender": "female",
    "description": "The lieutenant of the 11th Division and Kenpachi's adoptive daughter, known for her playful nature and fighting skills.",
    "age": 30
  },
  {
    "name": "Shinji Hirako",
    "anime": "Bleach",
    "gender": "male",
    "description": "The leader of the Visored, a former Soul Reaper captain with the power to manipulate perception using his zanpakuto, Shikai.",
    "age": 100
  },
  {
    "name": "Hiyori Sarugaki",
    "anime": "Bleach",
    "gender": "female",
    "description": "A member of the Visored with a fiery personality and the ability to control fire with her zanpakuto.",
    "age": 100
  },
  {
    "name": "Kensei Muguruma",
    "anime": "Bleach",
    "gender": "male",
    "description": "A former Soul Reaper captain and member of the Visored, known for his enhanced physical strength and his zanpakuto, Tachikaze.",
    "age": 100
  },
  {
    "name": "Rose",
    "anime": "Bleach",
    "gender": "male",
    "description": "A member of the Visored with a zanpakuto that manipulates sound, known for his musical abilities and calm demeanor.",
    "age": 100
  },
  {
    "name": "Mashiro Kuna",
    "anime": "Bleach",
    "gender": "female",
    "description": "A member of the Visored with the ability to use her zanpakuto to manipulate wind and a playful personality.",
    "age": 100
  },
  {
    "name": "Love Aikawa",
    "anime": "Bleach",
    "gender": "male",
    "description": "A member of the Visored, known for his fiery temperament and zanpakuto, which can create powerful flames.",
    "age": 100
  },
  {
    "name": "Hachi",
    "anime": "Bleach",
    "gender": "male",
    "description": "A member of the Visored and former Soul Reaper captain, known for his expertise in Kido and his zanpakuto.",
    "age": 100
  },
  {
    "name": "Sado",
    "anime": "Bleach",
    "gender": "male",
    "description": "Also known as Chad, a friend of Ichigo with the ability to manifest powerful spiritual energy in his arms.",
    "age": 15
  },
  {
    "name": "Rangiku Matsumoto",
    "anime": "Bleach",
    "gender": "female",
    "description": "The lieutenant of the 10th Division and Hitsugaya's assistant, known for her laid-back attitude and zanpakuto, Haineko.",
    "age": 30
  },
  {
    "name": "Ikkaku Madarame",
    "anime": "Bleach",
    "gender": "male",
    "description": "A lieutenant of the 11th Division, known for his love of fighting and his zanpakuto, Hōzukimaru.",
    "age": 30
  },
  {
    "name": "Yumichika Ayasegawa",
    "anime": "Bleach",
    "gender": "male",
    "description": "A member of the 11th Division, known for his vanity and his zanpakuto, Ruri'iro Kujaku.",
    "age": 30
  },
  {
    "name": "Shunsui Kyoraku",
    "anime": "Bleach",
    "gender": "male",
    "description": "The captain of the 8th Division, known for his relaxed demeanor and zanpakuto, Katen Kyokotsu.",
    "age": 200
  },
  {
    "name": "Ukitake Jushiro",
    "anime": "Bleach",
    "gender": "male",
    "description": "The captain of the 13th Division, known for his illness and his powerful zanpakuto, Sōgyo no Kotowari.",
    "age": 200
  },
  {
    "name": "Kyoraku Shunsui",
    "anime": "Bleach",
    "gender": "male",
    "description": "The captain of the 8th Division, known for his strategic mind and zanpakuto, Katen Kyokotsu.",
    "age": 200
  },
  {
    "name": "Jushiro Ukitake",
    "anime": "Bleach",
    "gender": "male",
    "description": "The captain of the 13th Division, known for his illness and powerful zanpakuto, Sōgyo no Kotowari.",
    "age": 200
  },
  {
    "name": "Kisuke Urahara",
    "anime": "Bleach",
    "gender": "male",
    "description": "A former captain of the 12th Division, now a shop owner with extensive knowledge of Soul Reaper and Quincy techniques.",
    "age": 200
  },
  {
    "name": "Isshin Kurosaki",
    "anime": "Bleach",
    "gender": "male",
    "description": "Ichigo's father, a former Soul Reaper with the ability to fight against hollows and protect his family.",
    "age": 40
  },
  {
    "name": "Retsu Unohana",
    "anime": "Bleach",
    "gender": "female",
    "description": "The former captain of the 4th Division, known for her exceptional healing abilities and her combat prowess.",
    "age": 200
  },
  {
    "name": "Mayuri Kurotsuchi",
    "anime": "Bleach",
    "gender": "male",
    "description": "The captain of the 12th Division, known for his scientific experiments and zanpakuto, Ashisogi Jizo.",
    "age": 200
  },
  {
    "name": "Shunsui Kyoraku",
    "anime": "Bleach",
    "gender": "male",
    "description": "The captain of the 8th Division, known for his strategic mind and zanpakuto, Katen Kyokotsu.",
    "age": 200
  },
  {
    "name": "Jushiro Ukitake",
    "anime": "Bleach",
    "gender": "male",
    "description": "The captain of the 13th Division, known for his illness and powerful zanpakuto, Sōgyo no Kotowari.",
    "age": 200
  },
  {
    "name": "Kisuke Urahara",
    "anime": "Bleach",
    "gender": "male",
    "description": "A former captain of the 12th Division, now a shop owner with extensive knowledge of Soul Reaper and Quincy techniques.",
    "age": 200
  },
  {
    "name": "Isshin Kurosaki",
    "anime": "Bleach",
    "gender": "male",
    "description": "Ichigo's father, a former Soul Reaper with the ability to fight against hollows and protect his family.",
    "age": 40
  },
  {
    "name": "Retsu Unohana",
    "anime": "Bleach",
    "gender": "female",
    "description": "The former captain of the 4th Division, known for her exceptional healing abilities and her combat prowess.",
    "age": 200
  },
  {
    "name": "Mayuri Kurotsuchi",
    "anime": "Bleach",
    "gender": "male",
    "description": "The captain of the 12th Division, known for his scientific experiments and zanpakuto, Ashisogi Jizo.",
    "age": 200
  },
  {
    "name": "Yuji Itadori",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "The main protagonist with extraordinary physical abilities and the host of the King of Curses, Sukuna.",
    "age": 15
  },
  {
    "name": "Satoru Gojo",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A top-tier Jujutsu Sorcerer known for his immense power and the Six Eyes technique, and mentor to Yuji Itadori.",
    "age": 28
  },
  {
    "name": "Megumi Fushiguro",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer with the ability to summon Shikigami and a student at Tokyo Jujutsu High.",
    "age": 15
  },
  {
    "name": "Nobara Kugisaki",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer with a knack for using cursed tools and a student at Tokyo Jujutsu High.",
    "age": 15
  },
  {
    "name": "Sukuna Ryoumen",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "The King of Curses, a powerful and malevolent curse sealed inside Yuji Itadori.",
    "age": 1000
  },
  {
    "name": "Kento Nanami",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer known for his calm demeanor and his ability to use Ratio Technique in combat.",
    "age": 27
  },
  {
    "name": "Maki Zenin",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer from the Zenin clan known for her physical strength and proficiency with cursed tools.",
    "age": 19
  },
  {
    "name": "Toge Inumaki",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer with the power of Cursed Speech, allowing him to command others with his words.",
    "age": 17
  },
  {
    "name": "Panda",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Cursed Corpse with the ability to transform into different forms, and a student at Tokyo Jujutsu High.",
    "age": 16
  },
  {
    "name": "Aoi Todo",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A powerful Jujutsu Sorcerer with immense strength and the ability to switch places with others.",
    "age": 23
  },
  {
    "name": "Yoshino Yuuji",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A student and victim of a curse who forms a bond with Yuji Itadori.",
    "age": 16
  },
  {
    "name": "Jogo",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Curse who is one of the main antagonists and possesses powerful fire-based abilities.",
    "age": 100
  },
  {
    "name": "Hanami",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Curse with the ability to manipulate plants and nature, serving as one of the main antagonists.",
    "age": 100
  },
  {
    "name": "Mahito",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Curse who can manipulate human souls and alter their bodies, posing a significant threat to Jujutsu Sorcerers.",
    "age": 100
  },
  {
    "name": "Kinji Hakari",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer with the ability to utilize the power of cursed energy in combat.",
    "age": 25
  },
  {
    "name": "Utahime Iori",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer who is the teacher at Kyoto Jujutsu High, known for her defensive techniques.",
    "age": 30
  },
  {
    "name": "Kokichi Muta",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A student from Kyoto Jujutsu High who has the ability to use the Cursed Spirit manipulation.",
    "age": 18
  },
  {
    "name": "Tsumiki Fushiguro",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "The older sister of Megumi Fushiguro, who becomes entangled in the world of curses.",
    "age": 17
  },
  {
    "name": "Tsuchi",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer with expertise in earth-based curses and techniques.",
    "age": 30
  },
  {
    "name": "Sakuragi",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer known for her proficiency in combat and cursed techniques.",
    "age": 25
  },
  {
    "name": "Kurosaki",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer specializing in high-level curse combat and tactics.",
    "age": 28
  },
  {
    "name": "Yuta Okkotsu",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "The protagonist of the prequel series, known for his immense cursed energy and the power of Rika Orimoto.",
    "age": 18
  },
  {
    "name": "Rika Orimoto",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "Yuta Okkotsu's childhood friend who becomes a powerful Curse after her death.",
    "age": 17
  },
  {
    "name": "Gojo Satoru",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A top-tier Jujutsu Sorcerer known for his immense power and the Six Eyes technique, and mentor to Yuji Itadori.",
    "age": 28
  },
  {
    "name": "Kugisaki Nobara",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer with a knack for using cursed tools and a student at Tokyo Jujutsu High.",
    "age": 15
  },
  {
    "name": "Suguru Geto",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A former Jujutsu Sorcerer turned antagonist, known for his power to control curses and his role in the main conflict.",
    "age": 30
  },
  {
    "name": "Ryo Inui",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer with enhanced physical capabilities and curse manipulation skills.",
    "age": 22
  },
  {
    "name": "Mizuhara",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer specializing in water-based curses and techniques.",
    "age": 27
  },
  {
    "name": "Yui Kinoshita",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer known for her abilities in curse sealing and defensive techniques.",
    "age": 23
  },
  {
    "name": "Kinoshita Yui",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer known for her abilities in curse sealing and defensive techniques.",
    "age": 23
  },
  {
    "name": "Aoi Todo",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A powerful Jujutsu Sorcerer with immense strength and the ability to switch places with others.",
    "age": 23
  },
  {
    "name": "Shoko Ieiri",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A medical Jujutsu Sorcerer with the ability to heal injuries and manage cursed energy.",
    "age": 28
  },
  {
    "name": "Rika Orimoto",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "Yuta Okkotsu's childhood friend who becomes a powerful Curse after her death.",
    "age": 17
  },
  {
    "name": "Maki Zenin",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer from the Zenin clan known for her physical strength and proficiency with cursed tools.",
    "age": 19
  },
  {
    "name": "Toge Inumaki",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer with the power of Cursed Speech, allowing him to command others with his words.",
    "age": 17
  },
  {
    "name": "Panda",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Cursed Corpse with the ability to transform into different forms, and a student at Tokyo Jujutsu High.",
    "age": 16
  },
  {
    "name": "Aoi Todo",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A powerful Jujutsu Sorcerer with immense strength and the ability to switch places with others.",
    "age": 23
  },
  {
    "name": "Jogo",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Curse who is one of the main antagonists and possesses powerful fire-based abilities.",
    "age": 100
  },
  {
    "name": "Hanami",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Curse with the ability to manipulate plants and nature, serving as one of the main antagonists.",
    "age": 100
  },
  {
    "name": "Mahito",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Curse who can manipulate human souls and alter their bodies, posing a significant threat to Jujutsu Sorcerers.",
    "age": 100
  },
  {
    "name": "Kinji Hakari",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer with the ability to utilize the power of cursed energy in combat.",
    "age": 25
  },
  {
    "name": "Utahime Iori",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer who is the teacher at Kyoto Jujutsu High, known for her defensive techniques.",
    "age": 30
  },
  {
    "name": "Kokichi Muta",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A student from Kyoto Jujutsu High who has the ability to use the Cursed Spirit manipulation.",
    "age": 18
  },
  {
    "name": "Tsumiki Fushiguro",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "The older sister of Megumi Fushiguro, who becomes entangled in the world of curses.",
    "age": 17
  },
  {
    "name": "Tsuchi",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer with expertise in earth-based curses and techniques.",
    "age": 30
  },
  {
    "name": "Sakuragi",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer known for her proficiency in combat and cursed techniques.",
    "age": 25
  },
  {
    "name": "Kurosaki",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer specializing in high-level curse combat and tactics.",
    "age": 28
  },
  {
    "name": "Yuta Okkotsu",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "The protagonist of the prequel series, known for his immense cursed energy and the power of Rika Orimoto.",
    "age": 18
  },
  {
    "name": "Rika Orimoto",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "Yuta Okkotsu's childhood friend who becomes a powerful Curse after her death.",
    "age": 17
  },
  {
    "name": "Gojo Satoru",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A top-tier Jujutsu Sorcerer known for his immense power and the Six Eyes technique, and mentor to Yuji Itadori.",
    "age": 28
  },
  {
    "name": "Kugisaki Nobara",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer with a knack for using cursed tools and a student at Tokyo Jujutsu High.",
    "age": 15
  },
  {
    "name": "Suguru Geto",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A former Jujutsu Sorcerer turned antagonist, known for his power to control curses and his role in the main conflict.",
    "age": 30
  },
  {
    "name": "Ryo Inui",
    "anime": "Jujutsu Kaisen",
    "gender": "male",
    "description": "A Jujutsu Sorcerer with enhanced physical capabilities and curse manipulation skills.",
    "age": 22
  },
  {
    "name": "Mizuhara",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer specializing in water-based curses and techniques.",
    "age": 27
  },
  {
    "name": "Yui Kinoshita",
    "anime": "Jujutsu Kaisen",
    "gender": "female",
    "description": "A Jujutsu Sorcerer known for her abilities in curse sealing and defensive techniques.",
    "age": 23
  },
  {
    "name": "Goku",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "The main protagonist, a Saiyan with a pure heart who defends Earth with his incredible strength and martial arts skills.",
    "age": 34
  },
  {
    "name": "Vegeta",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "The Prince of the Saiyan race, initially an antagonist but later becomes a key ally with immense combat prowess.",
    "age": 50
  },
  {
    "name": "Gohan",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "Goku's eldest son, known for his hidden potential and powerful transformations.",
    "age": 25
  },
  {
    "name": "Piccolo",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A Namekian warrior and former antagonist who becomes one of Earth's greatest defenders and Goku's close ally.",
    "age": 50
  },
  {
    "name": "Krillin",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "Goku's best friend and a skilled martial artist known for his bravery and loyalty.",
    "age": 34
  },
  {
    "name": "Bulma",
    "anime": "Dragon Ball",
    "gender": "female",
    "description": "A brilliant scientist and inventor who plays a crucial role in aiding Goku and his friends.",
    "age": 40
  },
  {
    "name": "Trunks",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "Vegeta and Bulma's son, known for his role in the Android and Cell sagas and his time-traveling adventures.",
    "age": 18
  },
  {
    "name": "Frieza",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A tyrannical alien overlord with immense power and a significant antagonist in the series.",
    "age": 50
  },
  {
    "name": "Cell",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A bio-engineered being with the ability to absorb others and achieve powerful transformations.",
    "age": 35
  },
  {
    "name": "Majin Buu",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A powerful and ancient creature with various forms and abilities, known for his destructive tendencies.",
    "age": 500
  },
  {
    "name": "Android 18",
    "anime": "Dragon Ball",
    "gender": "female",
    "description": "An android with a strong sense of independence and a key ally to the Z Fighters.",
    "age": 30
  },
  {
    "name": "Android 17",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "An android with powerful combat abilities and a notable role in the Universal Survival Saga.",
    "age": 30
  },
  {
    "name": "Master Roshi",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "An ancient martial arts master known for his wisdom, strength, and perverted behavior.",
    "age": 350
  },
  {
    "name": "Yamcha",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A skilled martial artist and former desert bandit who becomes a reliable ally to Goku.",
    "age": 34
  },
  {
    "name": "Tien Shinhan",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A powerful martial artist with three eyes and strong techniques, known for his bravery and dedication.",
    "age": 34
  },
  {
    "name": "Chiaotzu",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A small but powerful martial artist and close friend of Tien Shinhan.",
    "age": 34
  },
  {
    "name": "Dende",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A Namekian who becomes the Earth’s Guardian after the events of the Namek Saga.",
    "age": 12
  },
  {
    "name": "King Kai",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "One of the Kais who oversees the North Galaxy and trains Goku and other Z Fighters.",
    "age": 500
  },
  {
    "name": "Kami",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "The Guardian of Earth and the original form of Piccolo, known for his wisdom and power.",
    "age": 500
  },
  {
    "name": "Yajirobe",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A swordsman who provides aid to the Z Fighters, known for his cowardice and ability to eat a lot.",
    "age": 34
  },
  {
    "name": "Goten",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "Goku's younger son with a cheerful personality and impressive combat skills for his age.",
    "age": 7
  },
  {
    "name": "Videl",
    "anime": "Dragon Ball",
    "gender": "female",
    "description": "Gohan's wife and the daughter of the World Martial Arts champion Mr. Satan.",
    "age": 18
  },
  {
    "name": "Mr. Satan",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A world-famous martial artist and hero known for his showmanship and eventual friendship with Goku.",
    "age": 50
  },
  {
    "name": "Gogeta",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "The fusion of Goku and Vegeta using the Fusion Dance, known for his immense power and combat skills.",
    "age": 34
  },
  {
    "name": "Vegito",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "The fusion of Goku and Vegeta using the Potara earrings, renowned for his extraordinary strength and abilities.",
    "age": 34
  },
  {
    "name": "Beerus",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "The God of Destruction of Universe 7, known for his immense power and love for food.",
    "age": 1000
  },
  {
    "name": "Whis",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "The angel attendant and mentor to Beerus, known for his incredible speed and abilities.",
    "age": 1000
  },
  {
    "name": "Jiren",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A powerful warrior from Universe 11, known for his strength and role as a member of the Pride Troopers.",
    "age": 40
  },
  {
    "name": "Hit",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A legendary assassin from Universe 6, known for his time-skip abilities and formidable fighting skills.",
    "age": 50
  },
  {
    "name": "Cabba",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A Saiyan from Universe 6 who becomes Goku’s ally and a member of the Saiyan race.",
    "age": 18
  },
  {
    "name": "Caulifla",
    "anime": "Dragon Ball",
    "gender": "female",
    "description": "A Saiyan from Universe 6, known for her aggressive fighting style and ability to transform into Super Saiyan.",
    "age": 18
  },
  {
    "name": "Kale",
    "anime": "Dragon Ball",
    "gender": "female",
    "description": "A Saiyan from Universe 6 who transforms into the Legendary Super Saiyan form.",
    "age": 18
  },
  {
    "name": "Kefla",
    "anime": "Dragon Ball",
    "gender": "female",
    "description": "The fusion of Caulifla and Kale, known for her immense power and fighting abilities.",
    "age": 18
  },
  {
    "name": "Dabura",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "The King of the Demon Realm, known for his role as an antagonist and his powerful curses.",
    "age": 50
  },
  {
    "name": "Babidi",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A wicked wizard who seeks to control powerful beings and awaken Majin Buu.",
    "age": 40
  },
  {
    "name": "Pui Pui",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A minion of Babidi with the ability to manipulate gravity and fight the Z Fighters.",
    "age": 25
  },
  {
    "name": "Yakon",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A demon-like servant of Babidi with the ability to absorb light and energy.",
    "age": 50
  },
  {
    "name": "Super Buu",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A more powerful form of Majin Buu, known for his terrifying abilities and destructive nature.",
    "age": 500
  },
  {
    "name": "Kid Buu",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "The original and most dangerous form of Majin Buu, known for his pure evil and chaotic behavior.",
    "age": 500
  },
  {
    "name": "Grand Supreme Kai",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A Supreme Kai with immense power who was absorbed by Majin Buu.",
    "age": 500
  },
  {
    "name": "Supreme Kai",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A high-ranking deity who oversees the universe and assists the Z Fighters.",
    "age": 500
  },
  {
    "name": "East Kai",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "One of the Kais who is responsible for overseeing the eastern part of the universe.",
    "age": 500
  },
  {
    "name": "West Kai",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "One of the Kais who oversees the western part of the universe.",
    "age": 500
  },
  {
    "name": "North Kai",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "One of the Kais who is responsible for the northern part of the universe.",
    "age": 500
  },
  {
    "name": "South Kai",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "One of the Kais who oversees the southern part of the universe.",
    "age": 500
  },
  {
    "name": "Towa",
    "anime": "Dragon Ball",
    "gender": "female",
    "description": "A demon scientist and antagonist who seeks to control the universe and manipulate time.",
    "age": 1000
  },
  {
    "name": "Mira",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A powerful demon warrior and Towa's partner, known for his combat skills and energy manipulation.",
    "age": 1000
  },
  {
    "name": "Pikkon",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A powerful warrior from the Other World known for his strength and fighting abilities.",
    "age": 30
  },
  {
    "name": "Ginyu Force",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A team of elite mercenaries working for Frieza, known for their unique fighting styles and techniques.",
    "age": 30
  },
  {
    "name": "Recoome",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A member of the Ginyu Force with immense strength and a flamboyant fighting style.",
    "age": 30
  },
  {
    "name": "Burta",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A member of the Ginyu Force known for his super-speed and unique fighting techniques.",
    "age": 30
  },
  {
    "name": "Jheese",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "A member of the Ginyu Force with the ability to shoot powerful energy blasts.",
    "age": 30
  },
  {
    "name": "Ginyu",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "The leader of the Ginyu Force with the ability to switch bodies with others.",
    "age": 30
  },
  {
    "name": "King Cold",
    "anime": "Dragon Ball",
    "gender": "male",
    "description": "Frieza's father and the former ruler of the universe, known for his powerful presence and control.",
    "age": 60
  },
  {
    "name": "Natsu Dragneel",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "The main protagonist of Fairy Tail, known for his fire-based magic and relentless determination to find his adopted dragon father.",
    "age": 19
  },
  {
    "name": "Lucy Heartfilia",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A Celestial Spirit Mage who joins Fairy Tail and uses her keys to summon powerful celestial spirits.",
    "age": 17
  },
  {
    "name": "Gray Fullbuster",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A skilled Ice-Make Mage with a competitive spirit and a complicated relationship with Natsu.",
    "age": 18
  },
  {
    "name": "Erza Scarlet",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A powerful Requip Mage known for her ability to change her armors and weapons in battle.",
    "age": 19
  },
  {
    "name": "Wendy Marvell",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A Dragon Slayer Mage with the ability to use Sky Dragon Slayer magic, known for her healing powers and kind heart.",
    "age": 12
  },
  {
    "name": "Happy",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A talking blue cat and Natsu’s loyal companion, known for his flying ability and love for fish.",
    "age": 6
  },
  {
    "name": "Makarov Dreyar",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "The master of Fairy Tail, known for his immense magical power and wisdom.",
    "age": 88
  },
  {
    "name": "Juvia Lockser",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A Water Mage who joins Fairy Tail and has a deep love for Gray, often exhibiting a dramatic personality.",
    "age": 18
  },
  {
    "name": "Gajeel Redfox",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A Dragon Slayer Mage with Iron Dragon Slayer magic, known for his tough exterior and eventual integration into Fairy Tail.",
    "age": 21
  },
  {
    "name": "Levy McGarden",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A skilled Solid Script Mage with a love for books and a close friendship with Gajeel.",
    "age": 17
  },
  {
    "name": "Laxus Dreyar",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A powerful Lightning Mage and Makarov's grandson, known for his strong sense of pride and leadership skills.",
    "age": 23
  },
  {
    "name": "Mirajane Strauss",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A Take Over Mage with the ability to transform into various demons, known for her caring nature and past trauma.",
    "age": 19
  },
  {
    "name": "Acnologia",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A powerful Dragon Slayer turned Dragon, known for his devastating magic and role as a major antagonist.",
    "age": 40
  },
  {
    "name": "Zeref Dragneel",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "An immortal dark wizard with a tragic past and a significant role in the series' conflict.",
    "age": 2000
  },
  {
    "name": "August",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "The powerful and strategic general of the Alvarez Empire, known for his formidable magic and leadership.",
    "age": 50
  },
  {
    "name": "Hades",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "The former master of Fairy Tail, turned dark wizard and antagonist known for his destructive magic and desire for revenge.",
    "age": 45
  },
  {
    "name": "Oración Seis",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A dark guild consisting of powerful mages who seek to control the magical world.",
    "age": 40
  },
  {
    "name": "Ultear Milkovich",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A powerful Mage who initially served as an antagonist but later becomes an ally and plays a crucial role in the story.",
    "age": 21
  },
  {
    "name": "Meredy",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A Mage with the ability to create and control magic-based barriers, known for her loyalty and connection to Ultear.",
    "age": 17
  },
  {
    "name": "Ivan Dreyar",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "The father of Laxus and founder of the dark guild Crime Sorcière, known for his complex relationship with his family.",
    "age": 45
  },
  {
    "name": "Jose Porla",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "The master of the dark guild Phantom Lord, known for his desire to take down Fairy Tail.",
    "age": 50
  },
  {
    "name": "Master Hades",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "The dark wizard who becomes the leader of the dark guild Grimoire Heart and seeks revenge against Fairy Tail.",
    "age": 45
  },
  {
    "name": "Bickslow",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A Mage with the ability to control and manipulate dolls, known for his playful and relaxed personality.",
    "age": 28
  },
  {
    "name": "Fried Justine",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A Mage who uses spatial magic to create and control powerful barriers and is a member of the Thunder God Tribe.",
    "age": 30
  },
  {
    "name": "Evergreen",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A Mage who can use her magical powers to control and create light-based attacks, and a member of the Thunder God Tribe.",
    "age": 24
  },
  {
    "name": "Warren Rocko",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A Mage who specializes in telepathy and is a supportive member of the Fairy Tail guild.",
    "age": 21
  },
  {
    "name": "Alzack Conell",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A Mage skilled in using firearms and a member of the Fairy Tail guild, known for his sharpshooting skills.",
    "age": 24
  },
  {
    "name": "Bisca Connell",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A Mage who uses firearms and is known for her strong sense of justice and connection to Alzack.",
    "age": 22
  },
  {
    "name": "Nab",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A Mage who uses plant-based magic and serves as a supportive character in the Fairy Tail guild.",
    "age": 30
  },
  {
    "name": "Jellal Fernandes",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A powerful Mage with the ability to control the celestial sphere and a complicated past with Erza.",
    "age": 22
  },
  {
    "name": "Simon",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A Mage with the ability to create and control magical constructs, known for his loyalty and tragic backstory.",
    "age": 18
  },
  {
    "name": "Kana Alberona",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A Mage who uses card-based magic and has a strong personality and connection to her past.",
    "age": 21
  },
  {
    "name": "Lucy Heartfilia",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A Celestial Spirit Mage who joins Fairy Tail and uses her keys to summon powerful celestial spirits.",
    "age": 17
  },
  {
    "name": "Rogue Cheney",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A Dragon Slayer Mage from Sabertooth with Shadow Dragon Slayer magic and a complex personality.",
    "age": 19
  },
  {
    "name": "Sting Eucliffe",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A Dragon Slayer Mage from Sabertooth with White Dragon Slayer magic, known for his competitive nature.",
    "age": 20
  },
  {
    "name": "Hibiki Lates",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A Mage with the ability to manipulate the magical properties of objects, known for his resourcefulness.",
    "age": 18
  },
  {
    "name": "Kageyama Shigeo",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A skilled Mage with the ability to manipulate shadows and is a member of the Fairy Tail guild.",
    "age": 23
  },
  {
    "name": "Hades",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "The former master of Fairy Tail, turned dark wizard and antagonist known for his destructive magic and desire for revenge.",
    "age": 45
  },
  {
    "name": "Zeref Dragneel",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "An immortal dark wizard with a tragic past and a significant role in the series' conflict.",
    "age": 2000
  },
  {
    "name": "Mavis Vermillion",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "The founder of the Fairy Tail guild, known for her powerful magic and role in the guild's history.",
    "age": 14
  },
  {
    "name": "Igneel",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A Fire Dragon who raised Natsu and has a significant role in the story as a dragon mentor.",
    "age": 1000
  },
  {
    "name": "Grandine",
    "anime": "Fairy Tail",
    "gender": "female",
    "description": "A Sky Dragon who raised Wendy and is known for her nurturing and protective nature.",
    "age": 1000
  },
  {
    "name": "Metalicana",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "An Iron Dragon who raised Gajeel and is known for his strength and protective nature.",
    "age": 1000
  },
  {
    "name": "Odin",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "A powerful mage from the ancient times with a strong connection to the magical world.",
    "age": 500
  },
  {
    "name": "Ankhseram",
    "anime": "Fairy Tail",
    "gender": "male",
    "description": "An ancient and powerful dark mage with a significant role in the series' backstory.",
    "age": 500
  },
  {
    "name": "Meliodas",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "The Dragon's Sin of Wrath and leader of the Seven Deadly Sins, known for his immense power and charming personality.",
    "age": 3000
  },
  {
    "name": "Elizabeth Liones",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "The princess of the Liones Kingdom, who plays a central role in the story and has a mysterious connection to Meliodas.",
    "age": 16
  },
  {
    "name": "Diane",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "The Serpent's Sin of Envy and a member of the Seven Deadly Sins, known for her giantess heritage and Earth manipulation abilities.",
    "age": 750
  },
  {
    "name": "Ban",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "The Fox's Sin of Greed, known for his immortality, incredible strength, and his quest to find the Fountain of Youth.",
    "age": 43
  },
  {
    "name": "King",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "The Grizzly's Sin of Sloth and Fairy King, known for his control over the Spirit Spear Chastiefol and his role in protecting the Fairy Forest.",
    "age": 1
  },
  {
    "name": "Gowther",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "The Goat's Sin of Lust, a member of the Seven Deadly Sins with the ability to manipulate reality and emotions.",
    "age": 1000
  },
  {
    "name": "Escanor",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "The Lion's Sin of Pride, known for his incredible power that peaks at noon, making him the most powerful of the Seven Deadly Sins.",
    "age": 40
  },
  {
    "name": "Merlin",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "The Boar's Sin of Gluttony and a powerful sorceress with vast magical abilities and a mysterious past.",
    "age": 3000
  },
  {
    "name": "Arthur Pendragon",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "The King of Camelot, known for his role in the quest for the Holy Sword and his connection to the mystical power of the Lady of the Lake.",
    "age": 18
  },
  {
    "name": "Zeldris",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "The Demon King’s youngest son and a powerful demon with the ability to control darkness and serve as a major antagonist.",
    "age": 2000
  },
  {
    "name": "Estarossa",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "The eldest son of the Demon King, known for his destructive abilities and complex relationship with his family.",
    "age": 3000
  },
  {
    "name": "Melascula",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A demon who serves as one of the Ten Commandments, known for her ability to manipulate souls and a major antagonist.",
    "age": 1500
  },
  {
    "name": "Galand",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A member of the Ten Commandments with the ability to petrify opponents and a major antagonist in the series.",
    "age": 2000
  },
  {
    "name": "Drole",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A member of the Ten Commandments with the ability to manipulate earth and a major antagonist in the series.",
    "age": 2000
  },
  {
    "name": "Gloxinia",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A member of the Ten Commandments and former Fairy King, known for his power over illusions and his tragic past.",
    "age": 2000
  },
  {
    "name": "Cabrera",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A powerful sorceress with a dark history and connection to the magical arts.",
    "age": 500
  },
  {
    "name": "Fraudrin",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A member of the Ten Commandments with the ability to possess and control others.",
    "age": 2000
  },
  {
    "name": "Rimuru Tempest",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A demon with the ability to control water and a role in the magical world.",
    "age": 50
  },
  {
    "name": "Tarmiel",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A member of the Ten Commandments with the power to control light and a complex role in the story.",
    "age": 2000
  },
  {
    "name": "Sariel",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A member of the Ten Commandments with the ability to control air and a significant antagonist.",
    "age": 2000
  },
  {
    "name": "Hendrickson",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A former Holy Knight turned antagonist, known for his dark ambitions and powerful magic.",
    "age": 35
  },
  {
    "name": "Gilthunder",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A Holy Knight known for his lightning-based magic and his role in the series as an ally and later antagonist.",
    "age": 22
  },
  {
    "name": "Margaret Liones",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "Elizabeth's older sister and a Holy Knight with a strong sense of duty.",
    "age": 18
  },
  {
    "name": "Jericho",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A Holy Knight with the ability to control wind and a complicated past with the Seven Deadly Sins.",
    "age": 19
  },
  {
    "name": "Griamore",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A Holy Knight with the ability to create barriers and a loyal ally to the Liones Kingdom.",
    "age": 25
  },
  {
    "name": "Diane",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "The Serpent's Sin of Envy and a member of the Seven Deadly Sins, known for her giantess heritage and Earth manipulation abilities.",
    "age": 750
  },
  {
    "name": "Hawk Mama",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "The mother of Hawk, a talking pig who helps the Seven Deadly Sins with her unique abilities.",
    "age": 30
  },
  {
    "name": "Hawk",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A talking pig and Meliodas' loyal companion, known for his ability to eat anything and his humorous personality.",
    "age": 10
  },
  {
    "name": "King",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "The Grizzly's Sin of Sloth and Fairy King, known for his control over the Spirit Spear Chastiefol and his role in protecting the Fairy Forest.",
    "age": 1
  },
  {
    "name": "Jillian",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A powerful sorceress with a significant role in the magical world.",
    "age": 30
  },
  {
    "name": "Gawain",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A skilled knight with strong combat abilities and a connection to the magical arts.",
    "age": 20
  },
  {
    "name": "Arthur Pendragon",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "The King of Camelot, known for his role in the quest for the Holy Sword and his connection to the mystical power of the Lady of the Lake.",
    "age": 18
  },
  {
    "name": "Nasi",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A powerful mage with a significant role in the magical world.",
    "age": 40
  },
  {
    "name": "Camelot Knights",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A group of skilled knights loyal to King Arthur and known for their combat skills.",
    "age": 30
  },
  {
    "name": "Elaine",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "The Fairy Princess and King's younger sister, known for her role in the Fairy Forest and her love for Ban.",
    "age": 500
  },
  {
    "name": "Nadja",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A skilled mage with a connection to the ancient magical arts.",
    "age": 25
  },
  {
    "name": "Valkyrie",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A powerful warrior with exceptional combat skills and a role in the magical world.",
    "age": 30
  },
  {
    "name": "Julius",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A skilled mage with a significant role in the magical world and a strong sense of justice.",
    "age": 35
  },
  {
    "name": "Griamore",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A Holy Knight with the ability to create barriers and a loyal ally to the Liones Kingdom.",
    "age": 25
  },
  {
    "name": "Ales",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A skilled mage with a role in the magical world and a strong sense of duty.",
    "age": 20
  },
  {
    "name": "Rein",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A powerful mage with a significant role in the magical world and a complex past.",
    "age": 22
  },
  {
    "name": "Alban",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A skilled knight with a role in the magical world and a strong sense of honor.",
    "age": 28
  },
  {
    "name": "Fay",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A powerful mage with exceptional magical abilities and a role in the magical world.",
    "age": 30
  },
  {
    "name": "Lina",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A skilled mage with a connection to ancient magical arts and a role in the story.",
    "age": 25
  },
  {
    "name": "Derek",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A powerful mage with a significant role in the magical world and a complex background.",
    "age": 35
  },
  {
    "name": "Harold",
    "anime": "Nanatsu no Taizai",
    "gender": "male",
    "description": "A skilled knight with exceptional combat abilities and a strong sense of duty.",
    "age": 40
  },
  {
    "name": "Ingrid",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A powerful mage with a role in the magical world and a complex past.",
    "age": 28
  },
  {
    "name": "Sienna",
    "anime": "Nanatsu no Taizai",
    "gender": "female",
    "description": "A skilled warrior with a significant role in the story and exceptional combat abilities.",
    "age": 20
  },
  {
    "name": "Izuku Midoriya",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "The main protagonist with the power to inherit other heroes' quirks and a strong desire to become a hero.",
    "age": 16
  },
  {
    "name": "Katsuki Bakugo",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A hot-headed and highly competitive hero-in-training with an explosive quirk.",
    "age": 16
  },
  {
    "name": "All Might",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "The former number one hero with the power of superhuman strength and speed, known for his symbol of peace.",
    "age": 50
  },
  {
    "name": "Ochaco Uraraka",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A hero-in-training with the ability to make objects weightless, known for her kindness and determination.",
    "age": 16
  },
  {
    "name": "Shoto Todoroki",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A hero-in-training with the power to control both ice and fire, known for his stoic demeanor and complex family background.",
    "age": 16
  },
  {
    "name": "Tenya Iida",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A hero-in-training with engine-powered legs, known for his sense of justice and leadership skills.",
    "age": 16
  },
  {
    "name": "Momo Yaoyorozu",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A hero-in-training with the ability to create objects from her body, known for her intelligence and strategic thinking.",
    "age": 16
  },
  {
    "name": "Eijiro Kirishima",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A hero-in-training with a quirk that hardens his body, known for his strong sense of camaraderie and bravery.",
    "age": 16
  },
  {
    "name": "Tsuyu Asui",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A hero-in-training with frog-like abilities, known for her practicality and strong moral compass.",
    "age": 16
  },
  {
    "name": "Fumikage Tokoyami",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A hero-in-training with a shadow quirk that can control dark entities, known for his calm and mysterious personality.",
    "age": 16
  },
  {
    "name": "Hanta Sero",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A hero-in-training with the ability to shoot tape from his elbows, known for his resourcefulness and humor.",
    "age": 16
  },
  {
    "name": "Yuga Aoyama",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A hero-in-training with the ability to shoot laser beams from his stomach, known for his flamboyant personality.",
    "age": 16
  },
  {
    "name": "Mezo Shoji",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A hero-in-training with multiple extra limbs, known for his quiet demeanor and supportive nature.",
    "age": 16
  },
  {
    "name": "Rikido Sato",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A hero-in-training with the ability to enhance his strength through sugar consumption, known for his sweet personality.",
    "age": 16
  },
  {
    "name": "Koji Koda",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A hero-in-training with the ability to control animals, known for his gentle nature and quiet demeanor.",
    "age": 16
  },
  {
    "name": "Nedzu",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "The intelligent and anthropomorphic principal of U.A. High School, known for his vast knowledge and strategic mind.",
    "age": 50
  },
  {
    "name": "Gran Torino",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A retired hero and mentor to All Might, known for his agility and wisdom.",
    "age": 70
  },
  {
    "name": "Aizawa Shota",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "The homeroom teacher of Class 1-A with the power to erase quirks and a strong dedication to his students.",
    "age": 30
  },
  {
    "name": "Hizashi Yamada",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A hero known as Present Mic with the ability to amplify his voice, and a close friend of Aizawa.",
    "age": 40
  },
  {
    "name": "Nemuri Kayama",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A hero known as Midnight with the ability to induce sleep with her quirk, known for her charismatic personality.",
    "age": 30
  },
  {
    "name": "Sir Nighteye",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A retired hero with the ability to see the future, known for his analytical and serious nature.",
    "age": 50
  },
  {
    "name": "Mirio Togata",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A top student of U.A. High School’s Hero Course with the ability to become intangible, known for his cheerful personality.",
    "age": 19
  },
  {
    "name": "Hawks",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A high-ranking hero with the ability to control his feathers, known for his laid-back attitude and efficiency.",
    "age": 23
  },
  {
    "name": "Twice",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A villain with the ability to duplicate objects and people, known for his split personality and tragic backstory.",
    "age": 30
  },
  {
    "name": "Dabi",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A villain with the ability to control and produce intense flames, known for his mysterious past and role in the League of Villains.",
    "age": 23
  },
  {
    "name": "Toga Himiko",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A villain with the ability to transform into anyone whose blood she consumes, known for her psychotic and playful nature.",
    "age": 17
  },
  {
    "name": "Stain",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A villain known as the Hero Killer with the ability to paralyze people through their blood, known for his strong anti-hero stance.",
    "age": 30
  },
  {
    "name": "Tomura Shigaraki",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "The leader of the League of Villains with the ability to decay anything he touches, known for his antagonistic role and complex motives.",
    "age": 21
  },
  {
    "name": "Re-Destro",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "The leader of the Meta Liberation Army with the ability to generate destructive force through his body.",
    "age": 40
  },
  {
    "name": "Magne",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A villain with the ability to create magnetic fields, known for her fierce personality and loyalty to the League of Villains.",
    "age": 30
  },
  {
    "name": "Compress",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A villain with the ability to compress objects and people into small spheres, known for his sophisticated demeanor.",
    "age": 30
  },
  {
    "name": "Kurogiri",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A villain with the ability to create and control a dark fog that can transport and disorient people, known for his calm and composed nature.",
    "age": 30
  },
  {
    "name": "Momo Yaoyorozu",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A hero-in-training with the ability to create objects from her body, known for her intelligence and strategic thinking.",
    "age": 16
  },
  {
    "name": "Shigaraki Tomura",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "The leader of the League of Villains with the quirk to decay anything he touches, known for his role as a major antagonist.",
    "age": 21
  },
  {
    "name": "Gigantomachia",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A giant villain with immense strength and durability, known for his loyalty to Shigaraki.",
    "age": 50
  },
  {
    "name": "Lady Nagant",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A former hero turned villain with the ability to shoot projectiles with high precision, known for her tragic backstory.",
    "age": 30
  },
  {
    "name": "Starservant",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A hero with the power to create and control star-like energy, known for her combat skills and heroic spirit.",
    "age": 25
  },
  {
    "name": "Sir Nighteye",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A retired hero with the ability to see the future, known for his analytical and serious nature.",
    "age": 50
  },
  {
    "name": "Mirio Togata",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A top student of U.A. High School’s Hero Course with the ability to become intangible, known for his cheerful personality.",
    "age": 19
  },
  {
    "name": "Momo Yaoyorozu",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A hero-in-training with the ability to create objects from her body, known for her intelligence and strategic thinking.",
    "age": 16
  },
  {
    "name": "Hawks",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A high-ranking hero with the ability to control his feathers, known for his laid-back attitude and efficiency.",
    "age": 23
  },
  {
    "name": "Magna",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A villain with magnetic powers, known for her fierce personality and role in the League of Villains.",
    "age": 30
  },
  {
    "name": "Toga Himiko",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A villain with the ability to transform into anyone whose blood she consumes, known for her psychotic and playful nature.",
    "age": 17
  },
  {
    "name": "Twice",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A villain with the ability to duplicate objects and people, known for his split personality and tragic backstory.",
    "age": 30
  },
  {
    "name": "Magne",
    "anime": "Boku no Hero Academia",
    "gender": "female",
    "description": "A villain with the ability to create magnetic fields, known for her fierce personality and loyalty to the League of Villains.",
    "age": 30
  },
  {
    "name": "Compress",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A villain with the ability to compress objects and people into small spheres, known for his sophisticated demeanor.",
    "age": 30
  },
  {
    "name": "Kurogiri",
    "anime": "Boku no Hero Academia",
    "gender": "male",
    "description": "A villain with the ability to create and control a dark fog that can transport and disorient people, known for his calm and composed nature.",
    "age": 30
  },
  {
    "name": "Subaru Natsuki",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "The main protagonist who is transported to a fantasy world and has the ability to return from death, known for his determination and emotional struggles.",
    "age": 17
  },
  {
    "name": "Emilia",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A half-elf with silver hair and a powerful magic affinity, known for her kind heart and role as a candidate for the throne.",
    "age": 18
  },
  {
    "name": "Rem",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A demon maid with blue hair who possesses powerful magical abilities and a deep sense of loyalty and love for Subaru.",
    "age": 17
  },
  {
    "name": "Ram",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "Rem's twin sister and a maid with the ability to control fire, known for her sharp tongue and strong sense of responsibility.",
    "age": 17
  },
  {
    "name": "Beatrice",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A spirit who resides in the Roswaal mansion and possesses powerful magic, known for her tsundere personality and deep attachment to the mansion.",
    "age": 400
  },
  {
    "name": "Roswaal L Mathers",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "The eccentric and powerful lord of the Roswaal mansion, known for his complex motives and role as a key figure in Subaru's journey.",
    "age": 30
  },
  {
    "name": "Puck",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A spirit contracted with Emilia who takes the form of a cat, known for his immense power and protective nature.",
    "age": 50
  },
  {
    "name": "Crusch Karsten",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A noblewoman and candidate for the throne with exceptional combat skills and a strong sense of justice.",
    "age": 25
  },
  {
    "name": "Felt",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A streetwise girl and candidate for the throne with a sharp wit and resourcefulness.",
    "age": 15
  },
  {
    "name": "Petra Leyte",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A young maid in the Roswaal mansion known for her kind nature and loyalty.",
    "age": 15
  },
  {
    "name": "Echidna",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "The Witch of Greed who resides in the Witch's Tea Party, known for her vast knowledge and manipulative nature.",
    "age": 1000
  },
  {
    "name": "Satella",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "The Witch of Envy who plays a crucial role in Subaru's journey and has a complex relationship with him.",
    "age": -1
  },
  {
    "name": "Garfield",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A demi-human with the ability to manipulate earth and a strong sense of protectiveness over his sister, Felt.",
    "age": 21
  },
  {
    "name": "Regulus Corneas",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "One of the Sin Archbishops of the Witch's Cult with the ability to control and manipulate time.",
    "age": -1
  },
  {
    "name": "Lye Batenkaitos",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A Sin Archbishop of the Witch's Cult with the power to control and consume memories.",
    "age": -1
  },
  {
    "name": "Petelgeuse Romanée-Conti",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "The Sin Archbishop of the Witch's Cult associated with Sloth, known for his fanatical behavior and disturbing personality.",
    "age": -1
  },
  {
    "name": "Henrietta",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A minor character with a role in the broader context of the story.",
    "age": -1
  },
  {
    "name": "Sirius",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with a significant role and abilities related to the broader plot.",
    "age": -1
  },
  {
    "name": "Garfiel Tinsel",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A demi-human with the ability to control earth and a complex relationship with Subaru.",
    "age": 21
  },
  {
    "name": "Kiritaka",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A character with a role in the broader context of Subaru's journey.",
    "age": -1
  },
  {
    "name": "Shima",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with significant interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Mikako",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character who plays a role in Subaru's journey and the world of Re:Zero.",
    "age": -1
  },
  {
    "name": "Julius Juukulius",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A knight who is highly skilled in combat and has a significant role in the story.",
    "age": 21
  },
  {
    "name": "Anastasia Hoshin",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A noblewoman and candidate for the throne with a sharp mind and political acumen.",
    "age": 25
  },
  {
    "name": "Witch of Lust",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character associated with the Witch's Cult with significant influence and abilities.",
    "age": -1
  },
  {
    "name": "Witch of Wrath",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with a significant role related to the Witch's Cult and its influence.",
    "age": -1
  },
  {
    "name": "Witch of Sloth",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character associated with the Witch's Cult with significant impact on the story.",
    "age": -1
  },
  {
    "name": "Witch of Greed",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with a complex role in Subaru's journey and the broader narrative.",
    "age": -1
  },
  {
    "name": "Witch of Pride",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with a significant role in the context of the Witch's Cult.",
    "age": -1
  },
  {
    "name": "Witch of Envy",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A central character with a major impact on Subaru's journey and the world.",
    "age": -1
  },
  {
    "name": "Al",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A minor character with a role in the broader context of the story.",
    "age": -1
  },
  {
    "name": "Liliana",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with significant interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Rimuru",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A character with a role in the broader narrative of Re:Zero.",
    "age": -1
  },
  {
    "name": "Natsuki",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character who plays a role in Subaru's journey and interactions with other characters.",
    "age": -1
  },
  {
    "name": "Shura",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with a significant role in the broader narrative.",
    "age": -1
  },
  {
    "name": "Zeno",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A character with important interactions and role in the story.",
    "age": -1
  },
  {
    "name": "Mikasa",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with significant influence and role in the broader context.",
    "age": -1
  },
  {
    "name": "Klaus",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A character with interactions and impact on the main story.",
    "age": -1
  },
  {
    "name": "Eris",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character who plays a role in the narrative and Subaru's journey.",
    "age": -1
  },
  {
    "name": "Hilda",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with a significant role in the world of Re:Zero.",
    "age": -1
  },
  {
    "name": "Miri",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with a role in the broader context of the story.",
    "age": -1
  },
  {
    "name": "Oskar",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A character with notable interactions in the world.",
    "age": -1
  },
  {
    "name": "Leona",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with a role in Subaru's journey and interactions.",
    "age": -1
  },
  {
    "name": "Nina",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with interactions related to the main plot.",
    "age": -1
  },
  {
    "name": "Ralph",
    "anime": "Re:Zero",
    "gender": "male",
    "description": "A character with significant role in the broader narrative.",
    "age": -1
  },
  {
    "name": "Martha",
    "anime": "Re:Zero",
    "gender": "female",
    "description": "A character with a role in Subaru's interactions and journey.",
    "age": -1
  },
  {
    "name": "Eren Yeager",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "The main protagonist who has the power to transform into a Titan and seeks to free humanity from the Titans.",
    "age": 19
  },
  {
    "name": "Mikasa Ackerman",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "Eren's adoptive sister and a skilled soldier known for her exceptional combat abilities and deep loyalty to Eren.",
    "age": 19
  },
  {
    "name": "Armin Arlert",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "Eren's childhood friend with a brilliant mind and strategic thinking, who also possesses the power to transform into a Titan.",
    "age": 19
  },
  {
    "name": "Levi Ackerman",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A highly skilled and stoic soldier known for his incredible combat prowess and leadership within the Survey Corps.",
    "age": 30
  },
  {
    "name": "Erwin Smith",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "The former commander of the Survey Corps, known for his charismatic leadership and strategic genius.",
    "age": 35
  },
  {
    "name": "Historia Reiss",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "The true heir to the throne and a skilled fighter, known for her development from a shy girl to a strong leader.",
    "age": 18
  },
  {
    "name": "Jean Kirstein",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A member of the 104th Training Corps known for his pragmatic approach and leadership qualities.",
    "age": 19
  },
  {
    "name": "Sasha Blouse",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A soldier known for her incredible marksmanship and love of food, often called 'Potato Girl' by her comrades.",
    "age": 19
  },
  {
    "name": "Connie Springer",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A member of the 104th Training Corps known for his easygoing personality and camaraderie.",
    "age": 19
  },
  {
    "name": "Reiner Braun",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A member of the Warriors and a Titan shifter with the power of the Armored Titan, known for his conflicted loyalties.",
    "age": 22
  },
  {
    "name": "Annie Leonhart",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A member of the Warriors with the power of the Female Titan, known for her combat skills and mysterious nature.",
    "age": 22
  },
  {
    "name": "Bertolt Fubar",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A member of the Warriors who possesses the power of the Colossal Titan, known for his towering presence and role in the plot.",
    "age": 22
  },
  {
    "name": "Zeke Yeager",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "The Beast Titan and Eren's half-brother, known for his strategic mind and pivotal role in the conflict between Marley and the Eldians.",
    "age": 24
  },
  {
    "name": "Hange Zoë",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A former Squad Leader and later Commander of the Survey Corps, known for her curiosity and love for Titans.",
    "age": 30
  },
  {
    "name": "Falco Grice",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A young Warrior candidate with a strong sense of justice and a compassionate nature.",
    "age": 17
  },
  {
    "name": "Gabi Braun",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A young Warrior candidate with a determined attitude and fierce combat skills.",
    "age": 15
  },
  {
    "name": "Kiyomi Azumabito",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A high-ranking figure from the Hizuru nation with political influence and a significant role in the story.",
    "age": 30
  },
  {
    "name": "Porco Galliard",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "The current inheritor of the Jaw Titan, known for his fierce combat skills and sense of duty.",
    "age": 25
  },
  {
    "name": "Marcel Galliard",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "The previous inheritor of the Jaw Titan and Porco's older brother, known for his role in the Warriors' initial mission.",
    "age": 25
  },
  {
    "name": "Ymir Fritz",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "The progenitor of all Titans, known for her tragic fate and pivotal role in Titan history.",
    "age": -1
  },
  {
    "name": "Kenny Ackerman",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "Levi's uncle and a skilled assassin, known for his role in the conflicts within the city.",
    "age": 40
  },
  {
    "name": "Dot Pixis",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "The commander of the Garrison Regiment, known for his tactical mind and leadership during critical battles.",
    "age": 50
  },
  {
    "name": "Hange Zoë",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A former Squad Leader and later Commander of the Survey Corps, known for her curiosity and love for Titans.",
    "age": 30
  },
  {
    "name": "Nanaba",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A soldier in the Survey Corps known for her leadership skills and dedication.",
    "age": 28
  },
  {
    "name": "Gelgar",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A soldier in the Survey Corps known for his combat experience and dedication.",
    "age": 30
  },
  {
    "name": "Rico Brzenska",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A former member of the elite Squad known for her exceptional combat abilities and leadership.",
    "age": 30
  },
  {
    "name": "Furlan Church",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A former member of Levi's squad known for his combat skills and role in the early story.",
    "age": 30
  },
  {
    "name": "Eren Kruger",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A former Titan shifter known for his role in the past and his connection to Eren Yeager.",
    "age": 40
  },
  {
    "name": "Nile Dock",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A high-ranking officer in the Military Police Brigade known for his tactical skills and experience.",
    "age": 45
  },
  {
    "name": "Hannes",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A former member of the Garrison Regiment known for his role in Eren's early life and his brave actions.",
    "age": 40
  },
  {
    "name": "Ruth",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A character with a role in the story's background and conflicts.",
    "age": 30
  },
  {
    "name": "Sophie",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A character involved in the broader context of the story.",
    "age": 28
  },
  {
    "name": "Lena",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A character with interactions and impact on the main narrative.",
    "age": 25
  },
  {
    "name": "Florian",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A character who plays a role in the conflicts and story.",
    "age": 26
  },
  {
    "name": "Udo",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A Warrior candidate known for his role in the Marleyan military and the broader conflict.",
    "age": 16
  },
  {
    "name": "Zofia",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A Warrior candidate known for her role in the Marleyan military and the broader conflict.",
    "age": 16
  },
  {
    "name": "Gabi Braun",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A young Warrior candidate with a determined attitude and fierce combat skills.",
    "age": 15
  },
  {
    "name": "Falco Grice",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A young Warrior candidate with a strong sense of justice and a compassionate nature.",
    "age": 17
  },
  {
    "name": "Nina Fortner",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A character who plays a role in the story's background and conflicts.",
    "age": 28
  },
  {
    "name": "Martin",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A character with a role in the broader narrative and interactions.",
    "age": 29
  },
  {
    "name": "Tina",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A character with notable interactions and significance.",
    "age": 30
  },
  {
    "name": "Wilhelm",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A character with a role in the broader context of the story.",
    "age": 32
  },
  {
    "name": "Alma",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A character with interactions related to the main plot.",
    "age": 25
  },
  {
    "name": "Julius",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A character with a significant role in the broader narrative.",
    "age": 31
  },
  {
    "name": "Claudia",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A character with a role in the story and interactions with the main cast.",
    "age": 28
  },
  {
    "name": "Dan",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A character with a significant role in the story and interactions.",
    "age": 35
  },
  {
    "name": "Eleanor",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A character with a notable presence in the broader narrative.",
    "age": 27
  },
  {
    "name": "Alfred",
    "anime": "Attack on Titan",
    "gender": "male",
    "description": "A character with significant impact and role in the story.",
    "age": 33
  },
  {
    "name": "Diana",
    "anime": "Attack on Titan",
    "gender": "female",
    "description": "A character with a role in the story's background and conflicts.",
    "age": 26
  },
  {
    "name": "Ahri",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A nine-tailed fox with magical abilities, known for her charm and agility in battle.",
    "age": -1
  },
  {
    "name": "Ashe",
    "anime": "League of Legends",
    "gender": "female",
    "description": "The Frost Archer and queen of Freljord, known for her skill with a bow and strategic mind.",
    "age": 24
  },
  {
    "name": "Yasuo",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A wandering swordsman with the ability to control wind, known for his skill and tragic backstory.",
    "age": 29
  },
  {
    "name": "Garen",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A powerful warrior from Demacia, known for his strong physical prowess and leadership.",
    "age": 24
  },
  {
    "name": "Jinx",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A manic and impulsive criminal with a penchant for chaos and explosives.",
    "age": 21
  },
  {
    "name": "Lux",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A light mage from Demacia with the ability to control light and a cheerful personality.",
    "age": 19
  },
  {
    "name": "Lee Sin",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A blind monk with exceptional martial arts skills and a deep connection to his spiritual beliefs.",
    "age": 30
  },
  {
    "name": "Ezreal",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A daring explorer and adventurer with powerful magical abilities.",
    "age": 22
  },
  {
    "name": "Miss Fortune",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A sharpshooter with a tragic past, known for her deadly precision and combat skills.",
    "age": 25
  },
  {
    "name": "Vi",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A tough and brash enforcer from Piltover, known for her powerful punches and strong sense of justice.",
    "age": 23
  },
  {
    "name": "Jhin",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A psychopathic serial killer with a talent for precision shooting and a flair for dramatic performances.",
    "age": 40
  },
  {
    "name": "Katarina",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A deadly assassin from Noxus, known for her agility and skills with daggers.",
    "age": 25
  },
  {
    "name": "Draven",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A flamboyant and arrogant champion with exceptional skills in throwing axes.",
    "age": 27
  },
  {
    "name": "Nasus",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A wise and ancient champion with the ability to manipulate sand, revered as a god-like figure in Shurima.",
    "age": 50
  },
  {
    "name": "Renekton",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A ferocious and ancient champion with the power of the croc-like Raptor, known for his rage and might.",
    "age": 30
  },
  {
    "name": "Ryze",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A powerful rune mage on a quest to find the World Runes and prevent disaster.",
    "age": 40
  },
  {
    "name": "Riven",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A former Noxian soldier with a broken sword and a quest for redemption.",
    "age": 25
  },
  {
    "name": "Irelia",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A blade dancer from Ionia who uses her telekinetic abilities to control her blades.",
    "age": 20
  },
  {
    "name": "Aatrox",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A fallen celestial warrior with a thirst for revenge, known for his immense strength and dark powers.",
    "age": 30
  },
  {
    "name": "Zed",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A master of the shadows and an assassin with the ability to manipulate darkness.",
    "age": 28
  },
  {
    "name": "Morgana",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A fallen angel with dark magic and a troubled past, known for her tormenting abilities.",
    "age": 25
  },
  {
    "name": "Karthus",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A death knight with the power to manipulate souls and spread despair.",
    "age": 35
  },
  {
    "name": "Thresh",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A sinister warden of the Shadow Isles with the ability to trap souls and spread fear.",
    "age": 40
  },
  {
    "name": "Xerath",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A powerful mage who wields arcane energy and seeks to rule the world.",
    "age": 40
  },
  {
    "name": "Jinx",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A manic and impulsive criminal with a penchant for chaos and explosives.",
    "age": 21
  },
  {
    "name": "Yuumi",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A magical cat from Bandle City who uses her abilities to aid her allies in battle.",
    "age": 7
  },
  {
    "name": "Poppy",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A yordle warrior with a powerful hammer and a strong sense of duty.",
    "age": 20
  },
  {
    "name": "Taliyah",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A young shuriman mage who can control and shape the earth.",
    "age": 19
  },
  {
    "name": "Nidalee",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A fierce hunter and shapeshifter from the Kumungu jungle.",
    "age": 25
  },
  {
    "name": "Darius",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A brutal warrior from Noxus known for his immense strength and merciless tactics.",
    "age": 35
  },
  {
    "name": "Shen",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A stoic and disciplined ninja who protects Ionia with his ability to harness shadow energy.",
    "age": 30
  },
  {
    "name": "Lulu",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A whimsical yordle mage who uses her magic to play tricks and aid her allies.",
    "age": 16
  },
  {
    "name": "Talon",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A deadly assassin from Noxus with exceptional skills in stealth and combat.",
    "age": 25
  },
  {
    "name": "Vayne",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A relentless hunter with a mission to rid the world of evil and corruption.",
    "age": 25
  },
  {
    "name": "Sona",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A silent and musical mage with the ability to heal and protect her allies through her music.",
    "age": 21
  },
  {
    "name": "Kennen",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A yordle ninja with the power of lightning and a strong sense of duty.",
    "age": 15
  },
  {
    "name": "Aurelion Sol",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A cosmic dragon with the power to manipulate stars and celestial forces.",
    "age": -1
  },
  {
    "name": "Syndra",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A powerful mage with the ability to control and manipulate dark energy.",
    "age": 25
  },
  {
    "name": "Hecarim",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A spectral cavalryman with immense strength and a fearsome presence.",
    "age": 30
  },
  {
    "name": "Warwick",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A monstrous and feral creature with a thirst for vengeance and powerful blood magic.",
    "age": 35
  },
  {
    "name": "Rengar",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A primal hunter with a keen sense of smell and a relentless drive to hunt his prey.",
    "age": 30
  },
  {
    "name": "Kassadin",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A Void mage who seeks to avenge his family and stop the Void's encroachment.",
    "age": 35
  },
  {
    "name": "Kalista",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A vengeful spirit and skilled lancer with a connection to the spectral realm.",
    "age": -1
  },
  {
    "name": "Elise",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A spider queen with a deadly bite and a thirst for power and immortality.",
    "age": 28
  },
  {
    "name": "Brand",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A fire mage with the ability to control flames and spread destruction.",
    "age": 30
  },
  {
    "name": "Swain",
    "anime": "League of Legends",
    "gender": "male",
    "description": "The Grand General of Noxus with powerful dark magic and a strategic mind.",
    "age": 40
  },
  {
    "name": "Caitlyn",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A skilled sharpshooter and detective known for her precision and investigative skills.",
    "age": 25
  },
  {
    "name": "Orianna",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A mechanical genius who controls a powerful ball and seeks to perfect her creations.",
    "age": 24
  },
  {
    "name": "Jhin",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A psychopathic serial killer with a talent for precision shooting and a flair for dramatic performances.",
    "age": 40
  },
  {
    "name": "Zilean",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A time mage with the ability to manipulate time and protect his allies.",
    "age": 50
  },
  {
    "name": "Fiora",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A duelist with exceptional swordsmanship and a quest to prove her superiority.",
    "age": 25
  },
  {
    "name": "Gnar",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A yordle who can transform into a giant beast and has a playful yet fierce personality.",
    "age": -1
  },
  {
    "name": "Lissandra",
    "anime": "League of Legends",
    "gender": "female",
    "description": "The Ice Witch who commands the power of ice and darkness.",
    "age": -1
  },
  {
    "name": "Camille",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A precision fighter with mechanical enhancements and a strong sense of duty.",
    "age": 25
  },
  {
    "name": "Zyra",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A plant mage with the ability to control and spread vegetation.",
    "age": 28
  },
  {
    "name": "Nami",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A sea mage with control over water and a quest to save her people.",
    "age": 25
  },
  {
    "name": "Rumble",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A yordle engineer who pilots a powerful mech and loves to tinker with gadgets.",
    "age": 17
  },
  {
    "name": "Janna",
    "anime": "League of Legends",
    "gender": "female",
    "description": "A wind mage who controls the elements and protects her allies.",
    "age": -1
  },
  {
    "name": "Taric",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A radiant warrior with the power to protect and heal his allies.",
    "age": 30
  },
  {
    "name": "Aatrox",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A fallen celestial warrior with a thirst for revenge, known for his immense strength and dark powers.",
    "age": 30
  },
  {
    "name": "Dr. Mundo",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A mad scientist with immense physical strength and durability.",
    "age": -1
  },
  {
    "name": "Ryze",
    "anime": "League of Legends",
    "gender": "male",
    "description": "A powerful rune mage on a quest to find the World Runes and prevent disaster.",
    "age": 40
  },
  {
    "name": "Artorias the Abysswalker",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A legendary knight known for his skill in battle and tragic fall to the Abyss.",
    "age": -1
  },
  {
    "name": "Gwyn, Lord of Cinder",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "The former lord of Anor Londo who sacrificed himself to link the fire, now a burned husk.",
    "age": -1
  },
  {
    "name": "Solaire of Astora",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A jolly and heroic knight seeking the sun, known for his optimism and helpful nature.",
    "age": -1
  },
  {
    "name": "Ornstein",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A dragon-slaying knight of the Dragon Slayer armor, known for his speed and skill.",
    "age": -1
  },
  {
    "name": "Smough",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A colossal and ruthless executioner known for his massive hammer and brutal tactics.",
    "age": -1
  },
  {
    "name": "Seath the Scaleless",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A dragon who betrayed his kin and sought immortality through dark sorcery.",
    "age": -1
  },
  {
    "name": "Nito",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "The first of the Dead and ruler of the Gravelord Covenant, known for his control over death.",
    "age": -1
  },
  {
    "name": "The Four Kings",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A group of powerful kings who became the kings of the Dark, known for their spectral appearances.",
    "age": -1
  },
  {
    "name": "Manus, Father of the Abyss",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "An ancient being corrupted by the Abyss, known for his immense power and rage.",
    "age": -1
  },
  {
    "name": "Gwynevere",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "The daughter of Gwyn and queen of Anor Londo, known for her illusions and kindness.",
    "age": -1
  },
  {
    "name": "Gwyndolin",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "The youngest son of Gwyn and guardian of the Darkmoon, known for his dark magic and deception.",
    "age": -1
  },
  {
    "name": "Logan",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A powerful sorcerer seeking knowledge, known for his quest for the legendary sorceries.",
    "age": -1
  },
  {
    "name": "Havel the Rock",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A formidable knight known for his impenetrable defense and immense strength.",
    "age": -1
  },
  {
    "name": "Sif",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A large and loyal wolf companion of Artorias, known for its mournful battle against the player.",
    "age": -1
  },
  {
    "name": "Quelana of Izalith",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "A witch of Izalith who survived the chaos and provides the player with pyromancies.",
    "age": -1
  },
  {
    "name": "Laurentius of the Great Swamp",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A pyromancer from the Great Swamp seeking to perfect his art.",
    "age": -1
  },
  {
    "name": "Andre of Astora",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A blacksmith in Undead Parish known for his skill in forging and repairing weapons.",
    "age": -1
  },
  {
    "name": "Petrus of Thorolund",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A cleric from Thorolund who seeks to spread his faith and offers aid to the player.",
    "age": -1
  },
  {
    "name": "Kingseeker Frampt",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A primordial serpent who serves as a guide to the player and helps in the quest to link the fire.",
    "age": -1
  },
  {
    "name": "Darkstalker Kaathe",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A primordial serpent who offers an alternative path to the player, seeking to perpetuate the Dark.",
    "age": -1
  },
  {
    "name": "Manus, Father of the Abyss",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "An ancient being corrupted by the Abyss, known for his immense power and rage.",
    "age": -1
  },
  {
    "name": "Hawkeye Gough",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A giant archer who once fought alongside Artorias, known for his prowess and tragic blindness.",
    "age": -1
  },
  {
    "name": "Oswald of Carim",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A cleric and merchant known for his dubious transactions and services.",
    "age": -1
  },
  {
    "name": "Domnhall of Zena",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A merchant who deals in rare items and offers to upgrade and repair equipment.",
    "age": -1
  },
  {
    "name": "Quelaag",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "A spider-like demon who guards the Chaos Covenant and is known for her tragic transformation.",
    "age": -1
  },
  {
    "name": "Quelaag's Sister",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "The unseen sister of Quelaag who resides in the Chaos Bed of Chaos and is tied to the chaos in the game.",
    "age": -1
  },
  {
    "name": "The Great Hollow Merchant",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A merchant found in the Great Hollow, known for his goods and hidden location.",
    "age": -1
  },
  {
    "name": "Maneater Mildred",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "A notorious invader known for her monstrous appearance and association with the Chaos Servants.",
    "age": -1
  },
  {
    "name": "Garl Vinland",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A formidable knight and protector of the Princess in the Sanctum, known for his dedication and combat skills.",
    "age": -1
  },
  {
    "name": "The Moonlight Butterfly",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A large and magical creature that guards the entrance to the Darkroot Garden.",
    "age": -1
  },
  {
    "name": "Ceaseless Discharge",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A towering and grotesque entity that guards the archives and has a tragic backstory.",
    "age": -1
  },
  {
    "name": "Blacksmith Vamos",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A blacksmith found in the Catacombs, known for his skill in forging and repairing equipment.",
    "age": -1
  },
  {
    "name": "Gravelord Nito",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "The ruler of the Gravelord Covenant, known for his control over death and the undead.",
    "age": -1
  },
  {
    "name": "Priscilla",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "A hybrid creature who guards the Painted World of Ariamis, known for her mysterious and tragic nature.",
    "age": -1
  },
  {
    "name": "Sif, the Great Grey Wolf",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A loyal wolf companion of Artorias, known for its sad and noble battle.",
    "age": -1
  },
  {
    "name": "Taurus Demon",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A massive demon encountered in the Undead Burg, known for its brute strength and ferocity.",
    "age": -1
  },
  {
    "name": "Capra Demon",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A demon encountered in the Capra Demon boss fight, known for its agility and challenge.",
    "age": -1
  },
  {
    "name": "Bed of Chaos",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "A monstrous entity born from the chaos of Izalith, known for its chaotic and destructive nature.",
    "age": -1
  },
  {
    "name": "The Lost Izalith",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A desolate and dangerous area consumed by chaos, known for its corrupted state and formidable enemies.",
    "age": -1
  },
  {
    "name": "The Gaping Dragon",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A grotesque and enormous dragon encountered in the Depths, known for its disturbing appearance and deadly attacks.",
    "age": -1
  },
  {
    "name": "Kingdom of Lothric",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A once-proud kingdom now in ruins, known for its dark history and haunting atmosphere.",
    "age": -1
  },
  {
    "name": "Pontiff Sulyvahn",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A powerful sorcerer and ruler of Irithyll, known for his dark magic and tyrannical rule.",
    "age": -1
  },
  {
    "name": "Abyss Watchers",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A group of undead warriors bound by duty to combat the Abyss, known for their relentless pursuit of their mission.",
    "age": -1
  },
  {
    "name": "Yhorm the Giant",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A colossal and tragic giant, known for his immense size and strength, who guards the Profaned Capital.",
    "age": -1
  },
  {
    "name": "Slave Knight Gael",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A tragic knight on a quest for the Dark Soul, known for his relentless pursuit and tragic fate.",
    "age": -1
  },
  {
    "name": "Sirris of the Sunless Realms",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "A warrior from the Sunless Realms seeking to protect the player and help in their quest.",
    "age": -1
  },
  {
    "name": "Aldrich, Devourer of Gods",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A powerful and corrupted cleric who devours gods, known for his horrifying appearance and dark powers.",
    "age": -1
  },
  {
    "name": "Nameless King",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A powerful and enigmatic king who wields lightning and reigns over the storm, known for his immense power.",
    "age": -1
  },
  {
    "name": "Sister Friede",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "A complex and tragic figure associated with the Painting of Ariandel, known for her role in the game's lore.",
    "age": -1
  },
  {
    "name": "Champion Gundyr",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A fallen and corrupted champion who guards the entrance to the Undead Settlement, known for his fierce combat skills.",
    "age": -1
  },
  {
    "name": "Soul of Cinder",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "The final boss of Dark Souls, representing the culmination of countless souls who linked the fire.",
    "age": -1
  },
  {
    "name": "Dark Eater Midir",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A powerful and corrupted dragon who resides in the ringed city, known for his immense strength and darkness.",
    "age": -1
  },
  {
    "name": "Yuria of Londor",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "A member of the Aldrich Faithful with a mysterious agenda and dark magic.",
    "age": -1
  },
  {
    "name": "Lorian, Elder Prince",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A prince cursed with affliction, known for his tragic fate and role in the game's final battles.",
    "age": -1
  },
  {
    "name": "Lothric, Younger Prince",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "The younger prince of Lothric, known for his role in the game's storyline and the challenges he presents.",
    "age": -1
  },
  {
    "name": "Shira of the Storm",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "A warrior with a role in the storm-ridden lands and a connection to the game's deeper lore.",
    "age": -1
  },
  {
    "name": "Dusk of Oolacile",
    "anime": "Dark Souls",
    "gender": "female",
    "description": "A sorceress trapped in the past, known for her role in the game's lore and her quest for freedom.",
    "age": -1
  },
  {
    "name": "Darklurker",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A hidden and powerful entity known for its dark powers and role in the hidden lore of the game.",
    "age": -1
  },
  {
    "name": "Patches",
    "anime": "Dark Souls",
    "gender": "male",
    "description": "A mischievous and unreliable character known for his trickery and humorous interactions.",
    "age": -1
  },
  {
    "name": "Issei Hyoudou",
    "anime": "High School DxD",
    "gender": "male",
    "description": "The protagonist who becomes a Devil and strives to become the Harem King while uncovering his own powers.",
    "age": 17
  },
  {
    "name": "Rias Gremory",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A high-ranking Devil and the leader of the Occult Research Club, known for her beauty and strong leadership.",
    "age": 18
  },
  {
    "name": "Akeno Himejima",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A high-ranking Devil and Rias's right-hand woman, known for her sadistic personality and powerful lightning magic.",
    "age": 18
  },
  {
    "name": "Asia Argento",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A former nun with healing powers who becomes a Devil and joins Issei's group.",
    "age": 17
  },
  {
    "name": "Koneko Toujou",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A young and powerful Nekomata Devil with a stoic personality and immense strength.",
    "age": 16
  },
  {
    "name": "Xenovia Quarta",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A former exorcist who becomes a Devil and wields a powerful sword known as Durandal.",
    "age": 17
  },
  {
    "name": "Irina Shidou",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A former exorcist and friend of Issei with strong religious beliefs and exceptional combat skills.",
    "age": 17
  },
  {
    "name": "Sona Sitri",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A high-ranking Devil and the leader of the Sitri peerage, known for her strategic mind and powerful water magic.",
    "age": 18
  },
  {
    "name": "Tsubaki Shinra",
    "anime": "High School DxD",
    "gender": "female",
    "description": "Sona Sitri's queen and a skilled strategist with the ability to create powerful weapons.",
    "age": 17
  },
  {
    "name": "Kiba Yuuto",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A Devil with the ability to wield sacred swords and a strong sense of justice.",
    "age": 17
  },
  {
    "name": "Ravel Phenex",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A young Devil from the Phenex family with powerful fire-based abilities and a cheerful personality.",
    "age": 14
  },
  {
    "name": "Grayfia Lucifuge",
    "anime": "High School DxD",
    "gender": "female",
    "description": "The maid and wife of Sirzechs Lucifer, known for her exceptional combat skills and devotion.",
    "age": 30
  },
  {
    "name": "Sirzechs Lucifer",
    "anime": "High School DxD",
    "gender": "male",
    "description": "The former Lucifer and one of the Four Great Satans, known for his immense power and leadership.",
    "age": 30
  },
  {
    "name": "Azazel",
    "anime": "High School DxD",
    "gender": "male",
    "description": "The Governor-General of the Fallen Angels, known for his relaxed personality and powerful abilities.",
    "age": -1
  },
  {
    "name": "Michael",
    "anime": "High School DxD",
    "gender": "male",
    "description": "The Archangel and leader of the Heaven's forces, known for his righteousness and powerful angelic abilities.",
    "age": -1
  },
  {
    "name": "Vali Lucifer",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A rival Devil and leader of the Vali Team, known for his immense power and goal to surpass the Devil's highest peak.",
    "age": 17
  },
  {
    "name": "Rias's Brother",
    "anime": "High School DxD",
    "gender": "male",
    "description": "Rias Gremory's older brother and one of the Four Great Satans, known for his immense power and leadership.",
    "age": -1
  },
  {
    "name": "Fenrir",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A powerful Norse beast with immense strength and a formidable presence.",
    "age": -1
  },
  {
    "name": "Lupusregina Beta",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A powerful werewolf with strong combat abilities and loyalty.",
    "age": -1
  },
  {
    "name": "Kokabiel",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A powerful fallen angel and antagonist known for his destructive abilities.",
    "age": -1
  },
  {
    "name": "Diodora Astaroth",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A Devil with a manipulative nature and a powerful, cursed ability.",
    "age": -1
  },
  {
    "name": "Mikako Satsukitake",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A Devil with a role in the complex world of the supernatural and its factions.",
    "age": -1
  },
  {
    "name": "Eris Phantasma",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A character with a significant role in the broader context of the series.",
    "age": -1
  },
  {
    "name": "Bovaro",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A character with a role in the supernatural factions and their conflicts.",
    "age": -1
  },
  {
    "name": "Tannin",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A powerful dragon who serves as a mentor and ally to the main characters.",
    "age": -1
  },
  {
    "name": "Beelzebub",
    "anime": "High School DxD",
    "gender": "male",
    "description": "One of the Seven Deadly Sins, known for his role in the series' dark and supernatural elements.",
    "age": -1
  },
  {
    "name": "Leviathan",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A powerful and enigmatic figure with significant influence in the supernatural world.",
    "age": -1
  },
  {
    "name": "Barakiel",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A powerful fallen angel with a strong presence and complex motivations.",
    "age": -1
  },
  {
    "name": "Kiba Yuuto",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A Devil with the ability to wield sacred swords and a strong sense of justice.",
    "age": 17
  },
  {
    "name": "Azazel",
    "anime": "High School DxD",
    "gender": "male",
    "description": "The Governor-General of the Fallen Angels, known for his relaxed personality and powerful abilities.",
    "age": -1
  },
  {
    "name": "Michael",
    "anime": "High School DxD",
    "gender": "male",
    "description": "The Archangel and leader of Heaven's forces, known for his righteousness and powerful angelic abilities.",
    "age": -1
  },
  {
    "name": "Yasaka",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A powerful and influential character in the supernatural world.",
    "age": -1
  },
  {
    "name": "Serafall Leviathan",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A high-ranking Devil and one of the Seven Great Satans, known for her cheerful personality and strength.",
    "age": -1
  },
  {
    "name": "Ravel Phenex",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A young Devil from the Phenex family with powerful fire-based abilities and a cheerful personality.",
    "age": 14
  },
  {
    "name": "Sairaorg Bael",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A powerful Devil with immense strength and a strong sense of honor and loyalty.",
    "age": 17
  },
  {
    "name": "Rias's Brother",
    "anime": "High School DxD",
    "gender": "male",
    "description": "Rias Gremory's older brother and one of the Four Great Satans, known for his immense power and leadership.",
    "age": -1
  },
  {
    "name": "Diehauser Belial",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A high-ranking Devil with significant influence and combat abilities.",
    "age": -1
  },
  {
    "name": "Ravel Phenex",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A young Devil from the Phenex family with powerful fire-based abilities and a cheerful personality.",
    "age": 14
  },
  {
    "name": "Vali Lucifer",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A rival Devil and leader of the Vali Team, known for his immense power and goal to surpass the Devil's highest peak.",
    "age": 17
  },
  {
    "name": "Leviathan",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A powerful and enigmatic figure with significant influence in the supernatural world.",
    "age": -1
  },
  {
    "name": "Diodora Astaroth",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A Devil with a manipulative nature and a powerful, cursed ability.",
    "age": -1
  },
  {
    "name": "Mikako Satsukitake",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A Devil with a role in the complex world of the supernatural and its factions.",
    "age": -1
  },
  {
    "name": "Eris Phantasma",
    "anime": "High School DxD",
    "gender": "female",
    "description": "A character with a significant role in the broader context of the series.",
    "age": -1
  },
  {
    "name": "Bovaro",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A character with a role in the supernatural factions and their conflicts.",
    "age": -1
  },
  {
    "name": "Tannin",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A powerful dragon who serves as a mentor and ally to the main characters.",
    "age": -1
  },
  {
    "name": "Beelzebub",
    "anime": "High School DxD",
    "gender": "male",
    "description": "One of the Seven Deadly Sins, known for his role in the series' dark and supernatural elements.",
    "age": -1
  },
  {
    "name": "Barakiel",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A powerful fallen angel with a strong presence and complex motivations.",
    "age": -1
  },
  {
    "name": "Kokabiel",
    "anime": "High School DxD",
    "gender": "male",
    "description": "A powerful fallen angel and antagonist known for his destructive abilities.",
    "age": -1
  },
  {
    "name": "Kazuma Satou",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "The protagonist who is reincarnated into a fantasy world and forms a dysfunctional party.",
    "age": 16
  },
  {
    "name": "Aqua",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A goddess of water who is optimistic but often causes trouble for the party.",
    "age": 19
  },
  {
    "name": "Megumin",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A powerful Arch Wizard with a love for Explosion magic and an eccentric personality.",
    "age": 14
  },
  {
    "name": "Darkness",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A Crusader with a masochistic streak and a strong sense of duty.",
    "age": 19
  },
  {
    "name": "Yunyun",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A rival mage to Megumin with a complex personality and a desire to prove herself.",
    "age": 15
  },
  {
    "name": "Eris",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A goddess who serves as a rival to Aqua and appears as a more competent deity.",
    "age": -1
  },
  {
    "name": "Vanir",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "A devil with a penchant for sales and manipulation, who runs a shop in the fantasy world.",
    "age": -1
  },
  {
    "name": "Kisuna",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A famous and enigmatic figure in the fantasy world, known for her unique personality and skills.",
    "age": -1
  },
  {
    "name": "Chris",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A thief who plays a minor role and interacts with Kazuma and his party.",
    "age": -1
  },
  {
    "name": "Wiz",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A lich who runs a magic shop and becomes an ally to Kazuma and his party.",
    "age": -1
  },
  {
    "name": "Arueshiba",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A high-ranking demon and notable antagonist in the fantasy world.",
    "age": -1
  },
  {
    "name": "Sylphina",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A prominent figure in the fantasy world with significant influence and abilities.",
    "age": -1
  },
  {
    "name": "Rorona",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "An alchemist with a role in the series, known for her skills and personality.",
    "age": -1
  },
  {
    "name": "Marimari",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character with a notable role in the fantasy world, interacting with the main cast.",
    "age": -1
  },
  {
    "name": "Gremlin",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "A mischievous creature with a role in the fantasy world and interactions with the party.",
    "age": -1
  },
  {
    "name": "Dullahan",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "A headless knight with a significant role in the fantasy world and battles.",
    "age": -1
  },
  {
    "name": "Chomosuke",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A cat-like creature that plays a role in the series' events and interactions.",
    "age": -1
  },
  {
    "name": "Katsuragi",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "A character with notable interactions with the main cast and influence in the series.",
    "age": -1
  },
  {
    "name": "Nisuko",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character with a role in the fantasy world and connections to the main story.",
    "age": -1
  },
  {
    "name": "Karin",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character who interacts with Kazuma and his party, known for her unique traits.",
    "age": -1
  },
  {
    "name": "Annie",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character with a role in the fantasy world, known for her interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Tomoe",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character with a significant role in the series, known for her abilities and interactions.",
    "age": -1
  },
  {
    "name": "Nell",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character with notable influence in the fantasy world and interactions with Kazuma.",
    "age": -1
  },
  {
    "name": "Mina",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character who plays a role in the fantasy world and interacts with the main characters.",
    "age": -1
  },
  {
    "name": "Furina",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character with a role in the series, known for her unique abilities and interactions.",
    "age": -1
  },
  {
    "name": "Rina",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character with significant influence and interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Baldur",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "A character with a role in the series, known for his abilities and personality.",
    "age": -1
  },
  {
    "name": "Goblins",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "Various goblins encountered by the party, known for their role as common enemies.",
    "age": -1
  },
  {
    "name": "Orcs",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "Various orcs encountered in the fantasy world, known for their strength and hostility.",
    "age": -1
  },
  {
    "name": "Dragons",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "Various dragons appearing in the series, known for their power and challenges they present.",
    "age": -1
  },
  {
    "name": "Spirits",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "Various spirits encountered by Kazuma and his party, known for their supernatural traits.",
    "age": -1
  },
  {
    "name": "Succubi",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "Various succubi encountered in the fantasy world, known for their seductive nature and abilities.",
    "age": -1
  },
  {
    "name": "Demons",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "Various demons with roles in the series, known for their power and antagonistic roles.",
    "age": -1
  },
  {
    "name": "High Priest",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "A character with a significant role in the fantasy world and interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Knight Captain",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "A character with a leadership role in the fantasy world, known for his combat skills.",
    "age": -1
  },
  {
    "name": "Magic King",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "A powerful figure in the fantasy world known for his magical abilities and influence.",
    "age": -1
  },
  {
    "name": "Lord of Darkness",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "A major antagonist known for his dark powers and significant role in the series.",
    "age": -1
  },
  {
    "name": "Warrior Queen",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character with a prominent role in the series, known for her combat skills and leadership.",
    "age": -1
  },
  {
    "name": "Enchanter",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "A character with magical abilities and influence in the fantasy world.",
    "age": -1
  },
  {
    "name": "Sorceress",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A powerful sorceress with significant interactions with the main characters.",
    "age": -1
  },
  {
    "name": "Mystic",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character with mystical abilities and a role in the fantasy world.",
    "age": -1
  },
  {
    "name": "Valkyrie",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A character with significant influence and abilities in the fantasy world.",
    "age": -1
  },
  {
    "name": "Princess",
    "anime": "KonoSuba",
    "gender": "female",
    "description": "A noble figure with a role in the series and interactions with the main cast.",
    "age": -1
  },
  {
    "name": "General",
    "anime": "KonoSuba",
    "gender": "male",
    "description": "A military leader with a role in the series and interactions with Kazuma's party.",
    "age": -1
  },
  {
    "name": "Rito Yuuki",
    "anime": "To Love-Ru",
    "gender": "male",
    "description": "The protagonist who is awkward around girls and often finds himself in embarrassing situations.",
    "age": 16
  },
  {
    "name": "Lala Satalin Deviluke",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "The princess of Deviluke who falls in love with Rito and causes chaos with her alien technology.",
    "age": 15
  },
  {
    "name": "Momo Belia Deviluke",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "Lala's younger sister, who is known for her scheming and attempts to help Rito in his romantic pursuits.",
    "age": 14
  },
  {
    "name": "Yami (Golden Darkness)",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A skilled assassin with a dark past who eventually becomes an ally to Rito and the others.",
    "age": -1
  },
  {
    "name": "Haruna Sairenji",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "Rito's classmate and crush who is kind-hearted but often finds herself in awkward situations with him.",
    "age": 16
  },
  {
    "name": "Saki Tenjouin",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A wealthy and talented student who has a complex relationship with Rito and a rival with Lala.",
    "age": 16
  },
  {
    "name": "Ryouko Mikado",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character who is part of the student council and has a role in the school’s events.",
    "age": -1
  },
  {
    "name": "Kyouko Usami",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A student at Rito's school known for her strong personality and involvement in various school activities.",
    "age": -1
  },
  {
    "name": "Mea Kurosaki",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a complex background and significant involvement in the series' events.",
    "age": -1
  },
  {
    "name": "Zastin",
    "anime": "To Love-Ru",
    "gender": "male",
    "description": "A high-ranking officer from Deviluke who serves as Lala's bodyguard and protector.",
    "age": -1
  },
  {
    "name": "Peke",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A robotic assistant created by Lala that provides support and comic relief.",
    "age": -1
  },
  {
    "name": "Rizel",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a role in the fantasy elements of the series and connections to Lala.",
    "age": -1
  },
  {
    "name": "Mikan Yuuki",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "Rito's younger sister who is supportive of her brother and often gets involved in the chaos surrounding him.",
    "age": 13
  },
  {
    "name": "Kibito",
    "anime": "To Love-Ru",
    "gender": "male",
    "description": "A character who plays a role in the series' supernatural aspects and interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Kyouko Maki",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a significant role in the series and interactions with Rito and others.",
    "age": -1
  },
  {
    "name": "Yami (Golden Darkness)",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A skilled assassin with a dark past who becomes an ally to Rito and the others.",
    "age": -1
  },
  {
    "name": "Kari",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a role in the series and interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Aria H. U. Gown",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a role in the series known for her connection to the main plot.",
    "age": -1
  },
  {
    "name": "Kaede Riko",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a role in the series and involvement in the school’s events.",
    "age": -1
  },
  {
    "name": "Shizuku Sangou",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character known for her role in the series and interactions with the main characters.",
    "age": -1
  },
  {
    "name": "Lala's Father",
    "anime": "To Love-Ru",
    "gender": "male",
    "description": "The King of Deviluke and Lala's father, known for his powerful presence and influence.",
    "age": -1
  },
  {
    "name": "Lala's Mother",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "The Queen of Deviluke and Lala's mother, known for her elegance and royal status.",
    "age": -1
  },
  {
    "name": "Demon Lord",
    "anime": "To Love-Ru",
    "gender": "male",
    "description": "A powerful antagonist with significant influence in the series' supernatural elements.",
    "age": -1
  },
  {
    "name": "Lady Deviluke",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a role in the series' fantasy world and connections to Lala.",
    "age": -1
  },
  {
    "name": "Aoi Kiriya",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a notable role in the series and interactions with the main characters.",
    "age": -1
  },
  {
    "name": "Kizuna",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a complex background and involvement in the series' plot.",
    "age": -1
  },
  {
    "name": "Demon Princess",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a significant role in the series and interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Minoru",
    "anime": "To Love-Ru",
    "gender": "male",
    "description": "A character with a role in the series and interactions with Rito and his friends.",
    "age": -1
  },
  {
    "name": "Ayumi",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a role in the series and involvement in various plot points.",
    "age": -1
  },
  {
    "name": "Arisa",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character known for her interactions with the main cast and role in the series.",
    "age": -1
  },
  {
    "name": "Tamao",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a notable role in the series and connections to the supernatural elements.",
    "age": -1
  },
  {
    "name": "Nana",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a role in the series and interactions with the main characters.",
    "age": -1
  },
  {
    "name": "Hime",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a role in the series and involvement in various events.",
    "age": -1
  },
  {
    "name": "Saeko",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a role in the series and interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Sumire Kanou",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character known for her role in the series and interactions with Rito.",
    "age": -1
  },
  {
    "name": "Riko Kanou",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with significant involvement in the series and connections to Rito.",
    "age": -1
  },
  {
    "name": "Shirley",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a role in the series and interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Lala's Friends",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "Various friends of Lala who play roles in the series' events.",
    "age": -1
  },
  {
    "name": "Demon General",
    "anime": "To Love-Ru",
    "gender": "male",
    "description": "A high-ranking demon with a significant role in the series' supernatural elements.",
    "age": -1
  },
  {
    "name": "Wendy",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a role in the series and interactions with Rito and his friends.",
    "age": -1
  },
  {
    "name": "Karin",
    "anime": "To Love-Ru",
    "gender": "female",
    "description": "A character with a notable role in the series and interactions with the main characters.",
    "age": -1
  },
  {
    "name": "Sora",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "The protagonist, a genius gamer who, along with his sister, is transported to a fantasy world to challenge its games.",
    "age": 18
  },
  {
    "name": "Shiro",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "Sora's younger sister and gaming partner, known for her exceptional intelligence and skills in games.",
    "age": 11
  },
  {
    "name": "Stephanie Dola",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "The princess of the Disboard kingdom who becomes an ally to Sora and Shiro.",
    "age": 16
  },
  {
    "name": "Jibril",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A powerful Flugel who serves as an antagonist-turned-ally with vast knowledge and magical abilities.",
    "age": -1
  },
  {
    "name": "Izuna Hatsuse",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A member of the Werebeast tribe and skilled in games, she initially opposes Sora and Shiro.",
    "age": 12
  },
  {
    "name": "Tet",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "The One True God of Disboard who challenges Sora and Shiro to games to prove their worth.",
    "age": -1
  },
  {
    "name": "Kraft's Piero",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "The leader of the Eastern Federation and a strategic thinker who competes against Sora and Shiro.",
    "age": -1
  },
  {
    "name": "Kurami Zell",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A high-ranking member of the Eastern Federation and a key figure in the series' political games.",
    "age": 16
  },
  {
    "name": "Fil",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A member of the Eastern Federation who participates in the political and strategic games.",
    "age": -1
  },
  {
    "name": "Niqol",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character involved in the political and strategic games within the series.",
    "age": -1
  },
  {
    "name": "Cheshire",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character with a role in the series, known for her involvement in the games.",
    "age": -1
  },
  {
    "name": "Sora's Father",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character with a background in the series, connected to Sora and Shiro's backstory.",
    "age": -1
  },
  {
    "name": "Sora's Mother",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character with a background in the series, connected to Sora and Shiro's past.",
    "age": -1
  },
  {
    "name": "Riku Dola",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character with a significant role in the series and connections to the Disboard kingdom.",
    "age": -1
  },
  {
    "name": "Miko",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character who plays a role in the fantasy world and interacts with the main cast.",
    "age": -1
  },
  {
    "name": "Rivalz",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character with a role in the series and interactions with Sora and Shiro.",
    "age": -1
  },
  {
    "name": "Marron",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character with a role in the series and involvement in various games.",
    "age": -1
  },
  {
    "name": "Riku Dola",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character with a significant role in the series and interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Kraft's Piero",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "The leader of the Eastern Federation and a strategic figure in the games.",
    "age": -1
  },
  {
    "name": "Cheshire",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character with a role in the series, known for her involvement in the fantasy world.",
    "age": -1
  },
  {
    "name": "Shiro's Guardian",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character with a protective role and connection to Shiro.",
    "age": -1
  },
  {
    "name": "Tet's Messenger",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character who delivers messages and serves as an intermediary for Tet.",
    "age": -1
  },
  {
    "name": "Yahiro",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character with a role in the series and connections to the main story.",
    "age": -1
  },
  {
    "name": "Ayumi",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character with interactions with the main cast and involvement in the series.",
    "age": -1
  },
  {
    "name": "Sora's Friend",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character from Sora's past with a role in the series.",
    "age": -1
  },
  {
    "name": "Shiro's Friend",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character from Shiro's past who interacts with the main cast.",
    "age": -1
  },
  {
    "name": "Jibril's Assistant",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character who assists Jibril and plays a role in the series.",
    "age": -1
  },
  {
    "name": "Izuna's Companion",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character who accompanies Izuna and participates in the games.",
    "age": -1
  },
  {
    "name": "Fil's Ally",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character who supports Fil and is involved in the political games.",
    "age": -1
  },
  {
    "name": "Niqol's Partner",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character who partners with Niqol and plays a role in the series.",
    "age": -1
  },
  {
    "name": "Kurami's Supporter",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character who supports Kurami and is involved in the games.",
    "age": -1
  },
  {
    "name": "Jibril's Rival",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character who opposes Jibril and participates in the series' conflicts.",
    "age": -1
  },
  {
    "name": "Riku's Advisor",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character who advises Riku and plays a role in the political landscape.",
    "age": -1
  },
  {
    "name": "Shiro's Mentor",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character who mentored Shiro and has a role in the backstory.",
    "age": -1
  },
  {
    "name": "Marron's Rival",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character who competes with Marron in the series' games.",
    "age": -1
  },
  {
    "name": "Sora's Rival",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character who competes against Sora and challenges him in various ways.",
    "age": -1
  },
  {
    "name": "Shiro's Rival",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character who competes with Shiro and presents challenges.",
    "age": -1
  },
  {
    "name": "Rival's Leader",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character who leads the rivals and plays a role in the series' games.",
    "age": -1
  },
  {
    "name": "Miko's Partner",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character who works with Miko and interacts with the main cast.",
    "age": -1
  },
  {
    "name": "Tet's Representative",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character who represents Tet and is involved in the series' events.",
    "age": -1
  },
  {
    "name": "Sora's Ally",
    "anime": "No Game No Life",
    "gender": "male",
    "description": "A character who allies with Sora and supports his goals.",
    "age": -1
  },
  {
    "name": "Shiro's Ally",
    "anime": "No Game No Life",
    "gender": "female",
    "description": "A character who allies with Shiro and helps her in various ways.",
    "age": -1
  },
  {
    "name": "Hollow Knight",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "The silent, enigmatic protagonist who explores Hallownest in search of purpose.",
    "age": -1
  },
  {
    "name": "Hornet",
    "anime": "Hollow Knight",
    "gender": "female",
    "description": "A skilled warrior with a mysterious past, she aids the Knight and is a key figure in the story.",
    "age": -1
  },
  {
    "name": "Iselda",
    "anime": "Hollow Knight",
    "gender": "female",
    "description": "A kind shopkeeper who runs a store in Dirtmouth and provides useful items for the Knight.",
    "age": -1
  },
  {
    "name": "Quirrel",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A wandering scholar who seeks knowledge about Hallownest and shares insights with the Knight.",
    "age": -1
  },
  {
    "name": "Zote the Mighty",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A boastful and somewhat inept warrior who often finds himself in trouble.",
    "age": -1
  },
  {
    "name": "Grimm",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "The leader of the Grimm Troupe who brings a dark carnival to Hallownest.",
    "age": -1
  },
  {
    "name": "Gorb",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "One of the Dreamers, who has a role in protecting the city from the Nightmare Realm.",
    "age": -1
  },
  {
    "name": "Myla",
    "anime": "Hollow Knight",
    "gender": "female",
    "description": "A cheerful miner who becomes corrupted by the infection.",
    "age": -1
  },
  {
    "name": "The Radiance",
    "anime": "Hollow Knight",
    "gender": "female",
    "description": "The main antagonist and a powerful being associated with the infection.",
    "age": -1
  },
  {
    "name": "Deepness",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character encountered in the Abyss, who has connections to the deeper lore of Hallownest.",
    "age": -1
  },
  {
    "name": "Millibelle",
    "anime": "Hollow Knight",
    "gender": "female",
    "description": "A vendor who sells charms and items, encountered in the fungal wastes.",
    "age": -1
  },
  {
    "name": "Lurien the Watcher",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "One of the Dreamers, who is crucial to the protection of Hallownest.",
    "age": -1
  },
  {
    "name": "Dung Defender",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A dung-loving warrior who guards the Royal Waterways.",
    "age": -1
  },
  {
    "name": "Menderbug",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A bug who helps repair the tram systems and provides useful upgrades.",
    "age": -1
  },
  {
    "name": "Elderbug",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "An old bug who resides in Dirtmouth and provides guidance to the Knight.",
    "age": -1
  },
  {
    "name": "Sly",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A merchant who sells useful items and charms in Dirtmouth.",
    "age": -1
  },
  {
    "name": "Tiso",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A mysterious and skilled warrior who challenges the Knight in battle.",
    "age": -1
  },
  {
    "name": "Salubra",
    "anime": "Hollow Knight",
    "gender": "female",
    "description": "A character who sells charms and provides information about them.",
    "age": -1
  },
  {
    "name": "Bapanada",
    "anime": "Hollow Knight",
    "gender": "female",
    "description": "A vendor who operates in the Hidden Dreams DLC area and offers unique items.",
    "age": -1
  },
  {
    "name": "Gigi",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A wandering merchant who sells rare and valuable items.",
    "age": -1
  },
  {
    "name": "Hera the Troupe",
    "anime": "Hollow Knight",
    "gender": "female",
    "description": "A character who appears in the Grimm Troupe questline and has a role in the game's lore.",
    "age": -1
  },
  {
    "name": "Ego",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character connected to the Dream Nail and the Dream Realm.",
    "age": -1
  },
  {
    "name": "Hornet's Father",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A mysterious figure with connections to Hornet's past.",
    "age": -1
  },
  {
    "name": "Hornet's Mother",
    "anime": "Hollow Knight",
    "gender": "female",
    "description": "A character with a significant role in Hornet's backstory.",
    "age": -1
  },
  {
    "name": "The Pale King",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "The ruler of Hallownest whose actions have deep impacts on the game's story.",
    "age": -1
  },
  {
    "name": "The White Lady",
    "anime": "Hollow Knight",
    "gender": "female",
    "description": "A mysterious character with connections to the Dreamers and the Hollow Knight.",
    "age": -1
  },
  {
    "name": "The Collector",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character obsessed with collecting and preserving the essence of Hallownest.",
    "age": -1
  },
  {
    "name": "Great Prince",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character of high status with influence in the lore of Hallownest.",
    "age": -1
  },
  {
    "name": "Moss Charger",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character encountered in the Greenpath area, known for its charging attacks.",
    "age": -1
  },
  {
    "name": "The No Eyes",
    "anime": "Hollow Knight",
    "gender": "female",
    "description": "A character with a unique appearance and role in the Dream Realm.",
    "age": -1
  },
  {
    "name": "The Soul Master",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A powerful enemy who wields Soul magic and is a boss in the game.",
    "age": -1
  },
  {
    "name": "The Soul Tyrant",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A stronger, more challenging version of the Soul Master.",
    "age": -1
  },
  {
    "name": "The Dream Warriors",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "Various characters encountered in the Dream Realm, each with unique challenges.",
    "age": -1
  },
  {
    "name": "The Dreamers",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "Three key figures who play a central role in the protection of Hallownest.",
    "age": -1
  },
  {
    "name": "The Abyss Watcher",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character associated with the deeper parts of Hallownest and its lore.",
    "age": -1
  },
  {
    "name": "The Nightmare King",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A powerful entity associated with the darker aspects of the game's world.",
    "age": -1
  },
  {
    "name": "The Broken Vessel",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A boss character with a tragic backstory and connection to the game's lore.",
    "age": -1
  },
  {
    "name": "The Void",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A mysterious and powerful entity connected to the deeper mysteries of Hallownest.",
    "age": -1
  },
  {
    "name": "The Shade",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character encountered throughout Hallownest, representing the Knight's past selves.",
    "age": -1
  },
  {
    "name": "The Forgotten One",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character who has been lost to time and plays a role in the game's deeper lore.",
    "age": -1
  },
  {
    "name": "The Pale Master",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character with connections to the Pale King's story and the lore of Hallownest.",
    "age": -1
  },
  {
    "name": "The Dreaming Bug",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character who appears in the Dream Realm and offers insights into the game's world.",
    "age": -1
  },
  {
    "name": "The Hollowed",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character who has been deeply affected by the infection and plays a role in the game's lore.",
    "age": -1
  },
  {
    "name": "The Void Wielder",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character with mastery over the Void, connected to the game's deeper mysteries.",
    "age": -1
  },
  {
    "name": "The Lost Kin",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A boss character with a tragic past and connection to the Hollow Knight.",
    "age": -1
  },
  {
    "name": "The Hidden Boss",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A secretive character encountered in hidden areas of Hallownest.",
    "age": -1
  },
  {
    "name": "The Ancient One",
    "anime": "Hollow Knight",
    "gender": "male",
    "description": "A character from Hallownest's ancient past with a role in the game's lore.",
    "age": -1
  },
  {
    "name": "Takemichi Hanagaki",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "The protagonist who travels back in time to prevent the death of his ex-girlfriend and change his own life.",
    "age": 26
  },
  {
    "name": "Hinata Tachibana",
    "anime": "Tokyo Revengers",
    "gender": "female",
    "description": "Takemichi's ex-girlfriend who is murdered in the present, motivating him to change the past.",
    "age": 25
  },
  {
    "name": "Naoto Tachibana",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "Hinata's younger brother who becomes a detective and helps Takemichi with his time-traveling missions.",
    "age": 26
  },
  {
    "name": "Manjiro Sano (Mikey)",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "The leader of the Tokyo Manji Gang, known for his charismatic and powerful presence.",
    "age": 15
  },
  {
    "name": "Ken Ryuguji (Draken)",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "Mikey's right-hand man and a key figure in the Tokyo Manji Gang, known for his strength and loyalty.",
    "age": 15
  },
  {
    "name": "Tetta Kisaki",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A key antagonist who manipulates events to gain power within the gang world.",
    "age": -1
  },
  {
    "name": "Keisuke Baji",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A former member of the Tokyo Manji Gang who plays a crucial role in the gang's history.",
    "age": 15
  },
  {
    "name": "Chifuyu Matsuno",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "Baji's close friend and fellow gang member, known for his loyalty and fighting skills.",
    "age": 15
  },
  {
    "name": "Emma Sano",
    "anime": "Tokyo Revengers",
    "gender": "female",
    "description": "Mikey's adopted sister who becomes involved in the gang's dynamics and Takemichi's life.",
    "age": 15
  },
  {
    "name": "Hakkai Shiba",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A former member of the Black Dragons who later joins the Tokyo Manji Gang.",
    "age": 15
  },
  {
    "name": "Koko Shib",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A member of the Black Dragons who is known for his intelligence and strategic skills.",
    "age": 15
  },
  {
    "name": "Draken's Sister",
    "anime": "Tokyo Revengers",
    "gender": "female",
    "description": "Draken's younger sister who has a role in his personal life.",
    "age": -1
  },
  {
    "name": "Mitsuya Takashi",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A member of the Tokyo Manji Gang known for his leadership qualities and strong sense of justice.",
    "age": 15
  },
  {
    "name": "Hanma Shuji",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "An antagonist with connections to various gangs and manipulative schemes.",
    "age": -1
  },
  {
    "name": "Kurokawa Izana",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "The leader of the Tenjiku Gang and a key antagonist in the series.",
    "age": 15
  },
  {
    "name": "Sanzu Haruchiyo",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A member of the Tenjiku Gang known for his unpredictability and dangerous nature.",
    "age": -1
  },
  {
    "name": "Pah-chin",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A member of the Tokyo Manji Gang who is known for his tough demeanor and loyalty.",
    "age": 15
  },
  {
    "name": "Wakasa Ichiro",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A member of the Tokyo Manji Gang who is known for his strength and skill in combat.",
    "age": 15
  },
  {
    "name": "Rindo Haitani",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A member of the Haitani Brothers who becomes involved in the gang conflicts.",
    "age": 15
  },
  {
    "name": "Kisaki Tetta",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A manipulative figure with a role in various conflicts and power struggles within the gang world.",
    "age": -1
  },
  {
    "name": "Ran Haitani",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "Rindo's brother and a member of the Haitani Brothers, known for his combat skills and gang involvement.",
    "age": 15
  },
  {
    "name": "Yuzuha Shiba",
    "anime": "Tokyo Revengers",
    "gender": "female",
    "description": "Hakkai's younger sister who plays a role in the gang's dynamics and conflicts.",
    "age": 15
  },
  {
    "name": "Shinichiro Sano",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "Mikey's older brother who has a significant impact on the story and gang's history.",
    "age": -1
  },
  {
    "name": "Ryohei Hayashida (Pah-chin)",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A member of the Tokyo Manji Gang known for his strength and loyalty.",
    "age": 15
  },
  {
    "name": "Souta",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A character connected to the gang conflicts and events.",
    "age": -1
  },
  {
    "name": "Kizaki's Minions",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "Various minions and followers who serve Kizaki and play roles in his schemes.",
    "age": -1
  },
  {
    "name": "Kei",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A character involved in the gang dynamics and conflicts.",
    "age": -1
  },
  {
    "name": "Atsushi",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A character with connections to the gang world and key events.",
    "age": -1
  },
  {
    "name": "Rika",
    "anime": "Tokyo Revengers",
    "gender": "female",
    "description": "A character with a significant role in the backstory and personal connections.",
    "age": -1
  },
  {
    "name": "Mikasa",
    "anime": "Tokyo Revengers",
    "gender": "female",
    "description": "A character with a role in the story and interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Yoshiki",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A character involved in the gang conflicts and series' events.",
    "age": -1
  },
  {
    "name": "Takahashi",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A character who plays a role in the gang dynamics and story progression.",
    "age": -1
  },
  {
    "name": "Kanemura",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A member of the various gangs involved in the series.",
    "age": -1
  },
  {
    "name": "Aoi",
    "anime": "Tokyo Revengers",
    "gender": "female",
    "description": "A character with connections to the gang world and interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Eiji",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A character involved in the gang conflicts and story progression.",
    "age": -1
  },
  {
    "name": "Tomo",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A character with a role in the series and interactions with the main characters.",
    "age": -1
  },
  {
    "name": "Riku",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A character connected to the backstory and gang events.",
    "age": -1
  },
  {
    "name": "Shinji",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A character with connections to the main cast and the gang conflicts.",
    "age": -1
  },
  {
    "name": "Natsuki",
    "anime": "Tokyo Revengers",
    "gender": "female",
    "description": "A character involved in the personal lives and gang dynamics.",
    "age": -1
  },
  {
    "name": "Miyamoto",
    "anime": "Tokyo Revengers",
    "gender": "male",
    "description": "A character with a role in the gang world and series' events.",
    "age": -1
  },
  {
    "name": "Kozue",
    "anime": "Tokyo Revengers",
    "gender": "female",
    "description": "A character who interacts with the main cast and has a role in the story.",
    "age": -1
  },
  {
    "name": "Doraemon",
    "anime": "Doraemon",
    "gender": "male",
    "description": "A robotic cat from the future who travels back in time to help Nobita Nobi with his various problems.",
    "age": -1
  },
  {
    "name": "Nobita Nobi",
    "anime": "Doraemon",
    "gender": "male",
    "description": "The protagonist of the series, a lazy and unlucky boy who relies on Doraemon's gadgets to improve his life.",
    "age": 10
  },
  {
    "name": "Shizuka Minamoto",
    "anime": "Doraemon",
    "gender": "female",
    "description": "Nobita's kind and intelligent classmate who is often the target of his affections.",
    "age": 10
  },
  {
    "name": "Takeshi Gouda (Gian)",
    "anime": "Doraemon",
    "gender": "male",
    "description": "Nobita's strong but boisterous friend known for his love of food and singing, despite his lack of talent.",
    "age": 10
  },
  {
    "name": "Suneo Honekawa",
    "anime": "Doraemon",
    "gender": "male",
    "description": "A wealthy and often arrogant classmate of Nobita, known for bullying Nobita and his friends.",
    "age": 10
  },
  {
    "name": "Dekisugi",
    "anime": "Doraemon",
    "gender": "male",
    "description": "A highly intelligent and talented classmate who is popular with the girls, often seen as a rival to Nobita.",
    "age": 10
  },
  {
    "name": "Dorami",
    "anime": "Doraemon",
    "gender": "female",
    "description": "Doraemon's younger sister, also a robot cat from the future who occasionally helps Nobita.",
    "age": -1
  },
  {
    "name": "Nobi Tamako",
    "anime": "Doraemon",
    "gender": "female",
    "description": "Nobita's mother who is caring but often scolds Nobita for his bad habits.",
    "age": -1
  },
  {
    "name": "Nobi Nobisuke",
    "anime": "Doraemon",
    "gender": "male",
    "description": "Nobita's father who is kind but often oblivious to Nobita's troubles.",
    "age": -1
  },
  {
    "name": "Jaiko",
    "anime": "Doraemon",
    "gender": "female",
    "description": "Gian's younger sister, known for her love of drawing and her cheerful personality.",
    "age": -1
  },
  {
    "name": "Mii-chan",
    "anime": "Doraemon",
    "gender": "female",
    "description": "Shizuka's pet cat who appears occasionally in the series.",
    "age": -1
  },
  {
    "name": "Honekawa Natsumi",
    "anime": "Doraemon",
    "gender": "female",
    "description": "Suneo's younger sister, who occasionally appears in the series.",
    "age": -1
  },
  {
    "name": "Suneo's Father",
    "anime": "Doraemon",
    "gender": "male",
    "description": "Suneo's father, who is wealthy and influential.",
    "age": -1
  },
  {
    "name": "Suneo's Mother",
    "anime": "Doraemon",
    "gender": "female",
    "description": "Suneo's mother, who is a supportive and caring parent.",
    "age": -1
  },
  {
    "name": "Takeshi's Father",
    "anime": "Doraemon",
    "gender": "male",
    "description": "Gian's father, who is a hardworking and caring parent.",
    "age": -1
  },
  {
    "name": "Takeshi's Mother",
    "anime": "Doraemon",
    "gender": "female",
    "description": "Gian's mother, who is supportive and loving.",
    "age": -1
  },
  {
    "name": "Shizuka's Father",
    "anime": "Doraemon",
    "gender": "male",
    "description": "Shizuka's father, who is a kind and caring parent.",
    "age": -1
  },
  {
    "name": "Shizuka's Mother",
    "anime": "Doraemon",
    "gender": "female",
    "description": "Shizuka's mother, who is supportive and kind.",
    "age": -1
  },
  {
    "name": "The Robot Cat from the Future",
    "anime": "Doraemon",
    "gender": "male",
    "description": "Various robot cats from Doraemon's future world who appear in the series.",
    "age": -1
  },
  {
    "name": "Doraemon's Creator",
    "anime": "Doraemon",
    "gender": "male",
    "description": "The inventor who created Doraemon and other future robots.",
    "age": -1
  },
  {
    "name": "Nobita's Teacher",
    "anime": "Doraemon",
    "gender": "male",
    "description": "Nobita's school teacher who is often seen scolding him for his poor performance.",
    "age": -1
  },
  {
    "name": "The Principal",
    "anime": "Doraemon",
    "gender": "male",
    "description": "The principal of Nobita's school who oversees the students and teachers.",
    "age": -1
  },
  {
    "name": "The School Nurse",
    "anime": "Doraemon",
    "gender": "female",
    "description": "The nurse at Nobita's school who tends to the students' health needs.",
    "age": -1
  },
  {
    "name": "The School Janitor",
    "anime": "Doraemon",
    "gender": "male",
    "description": "The janitor who cleans the school and sometimes interacts with Nobita and his friends.",
    "age": -1
  },
  {
    "name": "The Future Nobita",
    "anime": "Doraemon",
    "gender": "male",
    "description": "An older version of Nobita who appears in future-related storylines.",
    "age": -1
  },
  {
    "name": "The Future Shizuka",
    "anime": "Doraemon",
    "gender": "female",
    "description": "An older version of Shizuka who appears in future-related storylines.",
    "age": -1
  },
  {
    "name": "The Future Takeshi",
    "anime": "Doraemon",
    "gender": "male",
    "description": "An older version of Gian who appears in future-related storylines.",
    "age": -1
  },
  {
    "name": "The Future Suneo",
    "anime": "Doraemon",
    "gender": "male",
    "description": "An older version of Suneo who appears in future-related storylines.",
    "age": -1
  },
  {
    "name": "The Future Dorami",
    "anime": "Doraemon",
    "gender": "female",
    "description": "An older version of Dorami who occasionally appears in the future.",
    "age": -1
  },
  {
    "name": "The Future Robot Cats",
    "anime": "Doraemon",
    "gender": "male",
    "description": "Various future robot cats who interact with Doraemon and Nobita.",
    "age": -1
  },
  {
    "name": "Nobita's Friend",
    "anime": "Doraemon",
    "gender": "male",
    "description": "A friend of Nobita who occasionally appears in different episodes.",
    "age": -1
  },
  {
    "name": "Shizuka's Friend",
    "anime": "Doraemon",
    "gender": "female",
    "description": "A friend of Shizuka who occasionally appears in the series.",
    "age": -1
  },
  {
    "name": "Gian's Friend",
    "anime": "Doraemon",
    "gender": "male",
    "description": "A friend of Gian who occasionally appears in the series.",
    "age": -1
  },
  {
    "name": "Suneo's Friend",
    "anime": "Doraemon",
    "gender": "male",
    "description": "A friend of Suneo who occasionally appears in the series.",
    "age": -1
  },
  {
    "name": "Nobita's Family Member",
    "anime": "Doraemon",
    "gender": "female",
    "description": "A member of Nobita's family who appears in future storylines.",
    "age": -1
  },
  {
    "name": "Shizuka's Family Member",
    "anime": "Doraemon",
    "gender": "female",
    "description": "A member of Shizuka's family who appears in future storylines.",
    "age": -1
  },
  {
    "name": "Gian's Family Member",
    "anime": "Doraemon",
    "gender": "male",
    "description": "A member of Gian's family who appears in future storylines.",
    "age": -1
  },
  {
    "name": "Suneo's Family Member",
    "anime": "Doraemon",
    "gender": "male",
    "description": "A member of Suneo's family who appears in future storylines.",
    "age": -1
  },
  {
    "name": "Doraemon's Friend",
    "anime": "Doraemon",
    "gender": "male",
    "description": "A friend of Doraemon from the future.",
    "age": -1
  },
  {
    "name": "Doraemon's Family Member",
    "anime": "Doraemon",
    "gender": "male",
    "description": "A member of Doraemon's future family.",
    "age": -1
  },
  {
    "name": "Finn the Human",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "The main protagonist, a brave and adventurous human boy who explores the Land of Ooo with his best friend Jake.",
    "age": 14
  },
  {
    "name": "Jake the Dog",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "Finn's magical shape-shifting dog who can stretch and transform into various forms.",
    "age": 28
  },
  {
    "name": "Princess Bubblegum",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "The ruler of the Candy Kingdom, known for her intelligence and scientific expertise.",
    "age": 18
  },
  {
    "name": "Marceline the Vampire Queen",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "A vampire with a love for music and a complex past, who is one of Finn's close friends.",
    "age": 1000
  },
  {
    "name": "Ice King",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "The main antagonist for much of the series, a former human turned into an ice wizard with a troubled past.",
    "age": 45
  },
  {
    "name": "Beemo",
    "anime": "Adventure Time",
    "gender": "non-binary",
    "description": "A sentient, living video game console who acts as a friend and housemate for Finn and Jake.",
    "age": -1
  },
  {
    "name": "Lady Rainicorn",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "A rainbow-colored unicorn from the Land of the Koreans who is Jake's girlfriend.",
    "age": -1
  },
  {
    "name": "Lumpy Space Princess",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "A lumpy, purple princess from the Lumpy Space who has a dramatic personality.",
    "age": 16
  },
  {
    "name": "Tree Trunks",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "An elderly, apple-loving elephant who lives in the Land of Ooo.",
    "age": -1
  },
  {
    "name": "Count Lemongrab",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A lemon-shaped, eccentric ruler with a distinct personality and a harsh demeanor.",
    "age": -1
  },
  {
    "name": "Prismo",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A wish-granting being who lives in a dimension outside of the main reality.",
    "age": -1
  },
  {
    "name": "Gunther",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "The Ice King's loyal penguin companion who often helps him in his schemes.",
    "age": -1
  },
  {
    "name": "The Earl of Lemongrab",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character known for his unique appearance and his role in the Candy Kingdom.",
    "age": -1
  },
  {
    "name": "BMO",
    "anime": "Adventure Time",
    "gender": "non-binary",
    "description": "A sentient, living video game console who is Finn and Jake's friend and household companion.",
    "age": -1
  },
  {
    "name": "Magic Man",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A powerful and mischievous magician who causes trouble for Finn and Jake.",
    "age": -1
  },
  {
    "name": "The Crown",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "An ancient and powerful artifact that grants immense magical power.",
    "age": -1
  },
  {
    "name": "Huntress Wizard",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "A skilled and mysterious wizard who lives in the forest and has a penchant for magic.",
    "age": -1
  },
  {
    "name": "The Flame Princess",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "The ruler of the Fire Kingdom with the ability to control fire and an on-and-off relationship with Finn.",
    "age": 15
  },
  {
    "name": "King of Ooo",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A ruler who appears in the post-apocalyptic future of the Land of Ooo.",
    "age": -1
  },
  {
    "name": "Sweet P",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character with a sweet and innocent personality, connected to the Land of Ooo's history.",
    "age": -1
  },
  {
    "name": "Susan Strong",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "A human-like character who lives in a post-apocalyptic underwater city.",
    "age": -1
  },
  {
    "name": "Abracadaniel",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A magician and rival of Magic Man with his own set of magical abilities.",
    "age": -1
  },
  {
    "name": "The Ice Queen",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "A character from the Ice Kingdom who has connections to the Ice King.",
    "age": -1
  },
  {
    "name": "Death",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character who represents death and has interactions with the main cast.",
    "age": -1
  },
  {
    "name": "Billy",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A legendary hero and mentor to Finn, known for his incredible strength and heroic deeds.",
    "age": -1
  },
  {
    "name": "Jeremiah",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character who appears in the post-apocalyptic future of the Land of Ooo.",
    "age": -1
  },
  {
    "name": "Fern",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character who is a plant-like version of Finn and has a complex relationship with him.",
    "age": -1
  },
  {
    "name": "BMO's Friends",
    "anime": "Adventure Time",
    "gender": "non-binary",
    "description": "Various characters who interact with BMO and appear in different episodes.",
    "age": -1
  },
  {
    "name": "The Lich",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A powerful and malevolent entity who serves as one of the main antagonists.",
    "age": -1
  },
  {
    "name": "Duke of Nuts",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character known for his eccentric behavior and connection to the Candy Kingdom.",
    "age": -1
  },
  {
    "name": "Rattleballs",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character with a skeletal appearance and a role in various episodes.",
    "age": -1
  },
  {
    "name": "The Villain",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A generic term for various antagonists who appear throughout the series.",
    "age": -1
  },
  {
    "name": "The Great Wizard",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A powerful wizard with significant influence over magical events in the Land of Ooo.",
    "age": -1
  },
  {
    "name": "Princess Bubblegum's Guards",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "Various guards who protect Princess Bubblegum and the Candy Kingdom.",
    "age": -1
  },
  {
    "name": "Shoko",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "A character with connections to the post-apocalyptic world and various storylines.",
    "age": -1
  },
  {
    "name": "Tara",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "A character who interacts with the main cast and has a role in the series.",
    "age": -1
  },
  {
    "name": "The Ghost Princess",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "A ghostly figure with ties to the Land of Ooo's history.",
    "age": -1
  },
  {
    "name": "The Royal Tart Toter",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character involved in the confectionery-related plots.",
    "age": -1
  },
  {
    "name": "The Cosmic Owl",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A mystical owl who appears in various dream sequences and storylines.",
    "age": -1
  },
  {
    "name": "The Star",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "A celestial entity with connections to the magical elements of the series.",
    "age": -1
  },
  {
    "name": "The Time Traveler",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character who travels through time and interacts with Finn and Jake.",
    "age": -1
  },
  {
    "name": "The Mantis",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character with a mantis-like appearance and role in the series.",
    "age": -1
  },
  {
    "name": "The Enchanted Forest",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A magical and mysterious forest that plays a role in various adventures.",
    "age": -1
  },
  {
    "name": "The Ancient Spirit",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character with ancient and mystical powers who influences events in the Land of Ooo.",
    "age": -1
  },
  {
    "name": "The Whispering Tree",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A mystical tree that communicates with characters and provides guidance.",
    "age": -1
  },
  {
    "name": "The Shadow",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A dark entity with connections to the Land of Ooo's magical aspects.",
    "age": -1
  },
  {
    "name": "The Lost Princess",
    "anime": "Adventure Time",
    "gender": "female",
    "description": "A character who is lost and plays a significant role in the series' adventures.",
    "age": -1
  },
  {
    "name": "The Secret Society",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A group with hidden motives and significant influence on the story.",
    "age": -1
  },
  {
    "name": "The Time King",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A character who rules over time-related events and dimensions.",
    "age": -1
  },
  {
    "name": "The Hidden Kingdom",
    "anime": "Adventure Time",
    "gender": "male",
    "description": "A mysterious and hidden kingdom with its own unique lore and characters.",
    "age": -1
  },
  {
    "name": "Shido Itsuka",
    "anime": "Date A Live",
    "gender": "male",
    "description": "The protagonist who has the ability to seal the powers of spirits and make them fall in love with him.",
    "age": -1
  },
  {
    "name": "Tohka Yatogami",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit of the Princess-type who has a cheerful personality and wields a sword.",
    "age": -1
  },
  {
    "name": "Kurumi Tokisaki",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the power to manipulate time and has a dark, mysterious personality.",
    "age": -1
  },
  {
    "name": "Origami Tobiichi",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A skilled warrior who initially appears as an antagonist but later becomes an ally.",
    "age": -1
  },
  {
    "name": "Miku Nakano",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who loves music and has the power to control sound.",
    "age": -1
  },
  {
    "name": "Yoshino",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who controls ice and has a shy, gentle demeanor.",
    "age": -1
  },
  {
    "name": "Kaguya Shindou",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who shares a twin-like connection with Yuzuru and has the power of creation.",
    "age": -1
  },
  {
    "name": "Yuzuru Shindou",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the ability to manipulate space and time, twin sister to Kaguya.",
    "age": -1
  },
  {
    "name": "Rinne Sonogami",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who wields the power of destruction and has a chaotic personality.",
    "age": -1
  },
  {
    "name": "Nia Honjo",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the ability to manipulate gravity and has a kind-hearted nature.",
    "age": -1
  },
  {
    "name": "Ellen Mira Mathers",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A powerful Spirit who can control darkness and has a strong-willed personality.",
    "age": -1
  },
  {
    "name": "Shirou Itsuka",
    "anime": "Date A Live",
    "gender": "male",
    "description": "Shido's older brother who has a deep connection to the Spirits.",
    "age": -1
  },
  {
    "name": "Tamae Nikaido",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who can control fire and has a fiery personality.",
    "age": -1
  },
  {
    "name": "Rina",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the power to manipulate emotions and has a playful demeanor.",
    "age": -1
  },
  {
    "name": "Satsuki Yatogami",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who can control light and has a calm, composed personality.",
    "age": -1
  },
  {
    "name": "Natsumi",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the ability to change her appearance and has a mischievous nature.",
    "age": -1
  },
  {
    "name": "Reine Murasame",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who can manipulate reality and has a mysterious, aloof demeanor.",
    "age": -1
  },
  {
    "name": "Mana Takamiya",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with immense power and a complex, enigmatic personality.",
    "age": -1
  },
  {
    "name": "Tawara Saki",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who can manipulate plants and has a serene, gentle nature.",
    "age": -1
  },
  {
    "name": "Ayumi Kanzaki",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A close friend of Shido and an important character in the series.",
    "age": -1
  },
  {
    "name": "Kagami",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the ability to control shadows and has a dark, reserved personality.",
    "age": -1
  },
  {
    "name": "Mio Takamiya",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the ability to control water and has a calm, nurturing nature.",
    "age": -1
  },
  {
    "name": "Fina",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the power to manipulate wind and has a free-spirited personality.",
    "age": -1
  },
  {
    "name": "Miharu Shindou",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who can control space and has a mysterious aura.",
    "age": -1
  },
  {
    "name": "Shirou Itsuka",
    "anime": "Date A Live",
    "gender": "male",
    "description": "Shido's older brother who has a significant role in the series.",
    "age": -1
  },
  {
    "name": "Aoi Kiryuu",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the ability to manipulate illusions and has a playful personality.",
    "age": -1
  },
  {
    "name": "Natsumi",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the power to shapeshift and a mischievous personality.",
    "age": -1
  },
  {
    "name": "Artemis",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who has the ability to manipulate light and has a regal demeanor.",
    "age": -1
  },
  {
    "name": "Lala",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the power to manipulate plants and a gentle, nurturing nature.",
    "age": -1
  },
  {
    "name": "Kaguya Shindou",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who has the power to create and manipulate reality.",
    "age": -1
  },
  {
    "name": "Yuzuru Shindou",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the ability to control space and time, twin sister to Kaguya.",
    "age": -1
  },
  {
    "name": "Nia Honjo",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who controls gravity and has a kind-hearted personality.",
    "age": -1
  },
  {
    "name": "Ellen Mira Mathers",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A powerful Spirit who controls darkness and has a strong will.",
    "age": -1
  },
  {
    "name": "Reine Murasame",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the power to alter reality and a mysterious demeanor.",
    "age": -1
  },
  {
    "name": "Satsuki Yatogami",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the power to control light and a calm personality.",
    "age": -1
  },
  {
    "name": "Tamae Nikaido",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with fire manipulation abilities and a fiery personality.",
    "age": -1
  },
  {
    "name": "Miku Nakano",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who loves music and can control sound.",
    "age": -1
  },
  {
    "name": "Rina",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who can manipulate emotions and has a playful demeanor.",
    "age": -1
  },
  {
    "name": "Mio Takamiya",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who controls water and has a nurturing nature.",
    "age": -1
  },
  {
    "name": "Kagami",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with shadow manipulation abilities and a dark personality.",
    "age": -1
  },
  {
    "name": "Fina",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with the power to control wind and a free-spirited personality.",
    "age": -1
  },
  {
    "name": "Artemis",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit who manipulates light and has a regal demeanor.",
    "age": -1
  },
  {
    "name": "Lala",
    "anime": "Date A Live",
    "gender": "female",
    "description": "A Spirit with plant manipulation abilities and a nurturing nature.",
    "age": -1
  },
  {
    "name": "Sonic the Hedgehog",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "The main protagonist known for his incredible speed and his quest to thwart Dr. Robotnik's plans.",
    "age": 15
  },
  {
    "name": "Tails",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "Sonic's best friend and sidekick who has two tails that allow him to fly.",
    "age": 8
  },
  {
    "name": "Knuckles the Echidna",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A strong and determined echidna known for his digging abilities and rivalry with Sonic.",
    "age": 16
  },
  {
    "name": "Amy Rose",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A pink hedgehog with a cheerful personality who wields a giant hammer and has a crush on Sonic.",
    "age": 12
  },
  {
    "name": "Shadow the Hedgehog",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A rival hedgehog with chaos powers and a dark, brooding personality.",
    "age": 50
  },
  {
    "name": "Rouge the Bat",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A treasure hunter and spy who is known for her cunning and resourcefulness.",
    "age": 18
  },
  {
    "name": "Dr. Eggman",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "The main antagonist who is a brilliant but evil scientist with plans to conquer the world.",
    "age": 50
  },
  {
    "name": "Silver the Hedgehog",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A future hedgehog with telekinetic powers who travels back in time to prevent disasters.",
    "age": 15
  },
  {
    "name": "Blaze the Cat",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A royal cat with the ability to control fire and a strong sense of duty.",
    "age": 14
  },
  {
    "name": "Vector the Crocodile",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A private detective and leader of the Chaotix team, known for his strength and loyalty.",
    "age": 27
  },
  {
    "name": "Espio the Chameleon",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A chameleon with the ability to become invisible and a skilled ninja.",
    "age": 18
  },
  {
    "name": "Charmy Bee",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A cheerful and energetic bee who is a member of the Chaotix team.",
    "age": 6
  },
  {
    "name": "Cream the Rabbit",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A kind-hearted rabbit who can fly with her ears and often accompanies Sonic on his adventures.",
    "age": 6
  },
  {
    "name": "Cheese",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "Cream's pet Chao who can attack enemies and assist Cream.",
    "age": -1
  },
  {
    "name": "Big the Cat",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A large, friendly cat known for his love of fishing and his gentle nature.",
    "age": 20
  },
  {
    "name": "Metal Sonic",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A robotic version of Sonic created by Dr. Eggman with similar abilities and a dark personality.",
    "age": -1
  },
  {
    "name": "Amy Rose",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A pink hedgehog with a cheerful personality who wields a giant hammer and has a crush on Sonic.",
    "age": 12
  },
  {
    "name": "Tikal the Echidna",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A guardian of the Master Emerald from the past who communicates with Knuckles.",
    "age": -1
  },
  {
    "name": "Chaos",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A powerful water monster who can change form and seeks to restore his lost power.",
    "age": -1
  },
  {
    "name": "Silver Sonic",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "An early prototype of Metal Sonic, built to challenge Sonic's speed.",
    "age": -1
  },
  {
    "name": "Dr. Eggman Nega",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A version of Dr. Eggman from an alternate dimension with similar evil intentions.",
    "age": -1
  },
  {
    "name": "Jet the Hawk",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A fast and cocky hawk who is the leader of the Babylon Rogues and a rival of Sonic.",
    "age": 17
  },
  {
    "name": "Wave the Swallow",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A skilled engineer and member of the Babylon Rogues, known for her flying skills.",
    "age": 18
  },
  {
    "name": "Storm the Albatross",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A strong but somewhat brutish member of the Babylon Rogues who pilots a large vehicle.",
    "age": 20
  },
  {
    "name": "Sonic Boom",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "An alternate version of Sonic from the *Sonic Boom* series with a different personality and appearance.",
    "age": 15
  },
  {
    "name": "Fiona Fox",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A character from the Archie Comics series who has a complicated history with Sonic.",
    "age": -1
  },
  {
    "name": "Mighty the Armadillo",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A powerful armadillo who is friends with Knuckles and is known for his strength.",
    "age": -1
  },
  {
    "name": "Ray the Flying Squirrel",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A flying squirrel with the ability to glide and an adventurous spirit.",
    "age": -1
  },
  {
    "name": "Omega",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A powerful and highly advanced robot created by Dr. Eggman, seeking revenge against his creator.",
    "age": -1
  },
  {
    "name": "Cream the Rabbit",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A kind-hearted rabbit who can fly with her ears and often accompanies Sonic on his adventures.",
    "age": 6
  },
  {
    "name": "Cheese",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "Cream's pet Chao who can attack enemies and assist Cream.",
    "age": -1
  },
  {
    "name": "Big the Cat",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A large, friendly cat known for his love of fishing and his gentle nature.",
    "age": 20
  },
  {
    "name": "Metal Sonic",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A robotic version of Sonic created by Dr. Eggman with similar abilities and a dark personality.",
    "age": -1
  },
  {
    "name": "Tikal the Echidna",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A guardian of the Master Emerald from the past who communicates with Knuckles.",
    "age": -1
  },
  {
    "name": "Chaos",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A powerful water monster who can change form and seeks to restore his lost power.",
    "age": -1
  },
  {
    "name": "Silver Sonic",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "An early prototype of Metal Sonic, built to challenge Sonic's speed.",
    "age": -1
  },
  {
    "name": "Dr. Eggman Nega",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A version of Dr. Eggman from an alternate dimension with similar evil intentions.",
    "age": -1
  },
  {
    "name": "Jet the Hawk",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A fast and cocky hawk who is the leader of the Babylon Rogues and a rival of Sonic.",
    "age": 17
  },
  {
    "name": "Wave the Swallow",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A skilled engineer and member of the Babylon Rogues, known for her flying skills.",
    "age": 18
  },
  {
    "name": "Storm the Albatross",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A strong but somewhat brutish member of the Babylon Rogues who pilots a large vehicle.",
    "age": 20
  },
  {
    "name": "Fiona Fox",
    "anime": "Sonic the Hedgehog",
    "gender": "female",
    "description": "A character from the Archie Comics series who has a complicated history with Sonic.",
    "age": -1
  },
  {
    "name": "Mighty the Armadillo",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A powerful armadillo who is friends with Knuckles and is known for his strength.",
    "age": -1
  },
  {
    "name": "Ray the Flying Squirrel",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A flying squirrel with the ability to glide and an adventurous spirit.",
    "age": -1
  },
  {
    "name": "Omega",
    "anime": "Sonic the Hedgehog",
    "gender": "male",
    "description": "A powerful and highly advanced robot created by Dr. Eggman, seeking revenge against his creator.",
    "age": -1
  }
]